emacs/modules.org
#+TITLE: Minemacs Modules
#+AUTHOR: MinasMazar
#+EMAIL: minasmazar@gmail.com
#+DATE: <2024-12-10 Tue>
#+STARTUP: overview
#+PROPERTY: header-args :tangle (minemacs-tangle-if-not-disabled "minemacs-modules.el") :mkdirp yes

* Minemacs core

#+begin_src elisp
  (defun eval-replace-last-sexp ()
    (interactive)
    (let ((value (eval (preceding-sexp))))
      (kill-sexp -1)
      (insert (format "%S" value))))

  (defun stringify (obj)
    (cond
     ((stringp obj) obj)
     ((symbolp obj) (symbol-name obj))
     (t (format "%s" obj))))

  (defun async-shell-command-no-window (command)
    (interactive "sAsync shell command (no window): ")
    (let ((display-buffer-alist
	   (list (cons shell-command-buffer-name-async (cons #'display-buffer-no-window nil)))))
      (async-shell-command command)))

  (defvar minemacs--cache (make-hash-table :test 'equal))
  (defvar minemacs-cache-directory (file-name-concat user-emacs-directory ".minemacs-cache"))

  (defun minemacs-cache-file-name (id &optional namespace)
    (expand-file-name (file-name-concat minemacs-cache-directory (stringify namespace) (md5 (stringify id)))))

  (defun minemacs-cache-key (id &optional namespace)
    (list :id id :namespace namespace))

  (defun minemacs-cache-get (id &optional namespace)
    (let* ((cache-key (minemacs-cache-file-name id namespace))
	  (cache-value (gethash cache-key minemacs--cache)))
      (if cache-value cache-value (minemacs-cache-get-from-file id namespace))))

  (defun minemacs-cache-get-from-file (id &optional namespace)
    (let* ((cache-key (minemacs-cache-file-name id namespace)))
      (when (file-readable-p cache-key)
	(with-temp-buffer
	  (insert-file-contents cache-key)
	  ;;(cl-assert (eq (point) (point-min)))
	  (read (current-buffer))))))

  (defun minemacs-cache-set (id data &optional namespace)
    (let* ((cache-key (minemacs-cache-file-name id namespace)))
      (puthash cache-key data minemacs--cache) data))

  (defun minemacs-cache-set-to-file (id data &optional namespace)
    (let* ((cache-key (minemacs-cache-file-name id namespace))
	   (cache-base-dir (file-name-directory cache-key)))
      (mkdir cache-base-dir t)
      (with-temp-file cache-key (prin1 data (current-buffer)))))
#+end_src

* Overrides
:PROPERTIES:
:header-args: :tangle (minemacs-tangle-if-not-disabled "overrides.el") :mkdirp yes
:END:

** Bookmarks + browse-url
Here add a custom bookmark handler relying on =browse-url= and =browse-url-handlers=, so even if we store a bookmark via =eww=, we're going to use the proper browser when opening it.

#+begin_src emacs-lisp
  (require 'eww)
  (require 'bookmark)
  (defun browse-url-bookmark-jump (bookmark)
    "Bookmark jump handler: relies on =browse-url-handler= to pick the right browser.
    Define a custom jumper avoid to open always on EWW in case the bookmark was placed with it"
    (browse-url (bookmark-prop-get bookmark 'location)))
  (defalias #'eww-bookmark-jump #'browse-url-bookmark-jump)
#+end_src

* Custom Helpers
:PROPERTIES:
:header-args: :tangle (minemacs-tangle-if-not-disabled "custom-helpers.el") :mkdirp yes
:END:

#+begin_src elisp
  (require 'cl-lib)
  (require 'ucs-normalize)

  (defun random-from-list (list)
    (nth (random (length list)) list))

  (defun dashize (str)
    (cl-remove-if
     (lambda (char)
       (> char 127))
     (ucs-normalize-NFKD-string (s-dashed-words str))))
#+end_src

* Info and Help
:PROPERTIES:
:header-args: :tangle (minemacs-tangle-if-not-disabled "info-help.el") :mkdirp yes
:END:

** Marginalia

#+begin_src elisp
  ;; Enable rich annotations using the Marginalia package
  (use-package marginalia
    ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
    ;; available in the *Completions* buffer, add it to the
    ;; `completion-list-mode-map'.
    :bind (:map minibuffer-local-map
	   ("M-A" . marginalia-cycle))

    ;; The :init section is always executed.
    :init

    ;; Marginalia must be activated in the :init section of use-package such that
    ;; the mode gets enabled right away. Note that this forces loading the
    ;; package.
    (marginalia-mode))
#+end_src

** Helpful                                                          :disabled:

#+begin_src elisp
  (use-package helpful
    :bind
    ("C-h f" . #'helpful-callable)
    ("C-h v" . #'helpful-variable)
    ("C-h k" . #'helpful-key)
    ("C-h x" . #'helpful-command))
#+end_src

** Show keybindings

#+begin_src elisp
  (use-package which-key
    :config
    (which-key-mode 1))
#+end_src

