emacs/modules.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Minemacs Modules</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Minemacs Modules</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb53a3e5">Minemacs core</a></li>
<li><a href="#orgd95bb0d">Overrides</a>
<ul>
<li><a href="#orgb0a66e0">Bookmarks + browse-url</a></li>
</ul>
</li>
<li><a href="#orgabd7cf4">Custom Helpers</a></li>
<li><a href="#org5910d2c">Info and Help</a>
<ul>
<li><a href="#orgf3e28bd">Marginalia</a></li>
<li><a href="#org18a0868">Helpful&#xa0;&#xa0;&#xa0;<span class="tag"><span class="disabled">disabled</span></span></a></li>
<li><a href="#orgfeb27b7">Show keybindings</a></li>
</ul>
</li>
<li><a href="#orgdd77928">Hail Hydra! 🐍&#xa0;&#xa0;&#xa0;<span class="tag"><span class="wip">wip</span>&#xa0;<span class="disabled">disabled</span></span></a></li>
<li><a href="#org62309f4">Helm 🛥️&#xa0;&#xa0;&#xa0;<span class="tag"><span class="disabled">disabled</span></span></a></li>
<li><a href="#org3a05504">Eshell</a>
<ul>
<li><a href="#orgbc61786">Functions</a></li>
<li><a href="#org7cf7d45">Scripts</a></li>
</ul>
</li>
<li><a href="#orgbd9bb8f">Imenu</a></li>
<li><a href="#org631a714">IDE 🖥️</a>
<ul>
<li><a href="#org73bfd89">MacOS compatibility</a></li>
<li><a href="#org0503862">Markup languages</a>
<ul>
<li><a href="#org55bd23d">Markdown</a></li>
</ul>
</li>
<li><a href="#org61499bd">Consult</a></li>
<li><a href="#org830350b">Data serialization</a></li>
<li><a href="#org9cc6d3b">Programming languages</a>
<ul>
<li><a href="#orgd977d36">Elixir</a></li>
</ul>
</li>
<li><a href="#orgffc86bd">Project</a></li>
<li><a href="#orga9c5533">Versioning</a></li>
<li><a href="#orga6fcfa4">Docker</a></li>
<li><a href="#org398fa15">Workspaces&#xa0;&#xa0;&#xa0;<span class="tag"><span class="disabled">disabled</span></span></a></li>
<li><a href="#orgdd5744e">Templating</a></li>
<li><a href="#org21d3b20">Terminal</a></li>
<li><a href="#orgd7efe7e">cht.sh</a></li>
<li><a href="#orgb7e117a">Github API</a></li>
</ul>
</li>
<li><a href="#org7254803">Knowledge base and second brain</a></li>
<li><a href="#orgd5ca3fc">Jarvis 🤖</a>
<ul>
<li><a href="#org4e3e158">Youtube 🎥</a>
<ul>
<li><a href="#org3ddf1b2">Helper functions</a></li>
<li><a href="#org617d101">Simple helpers: (randomly) pick and open a Youtube page in browser (or mpv)</a></li>
<li><a href="#orgff41ee6">Experimenting with the Google APIs (here's the doc).</a></li>
</ul>
</li>
<li><a href="#org5d6d202">Collector 🗄️</a>
<ul>
<li><a href="#org8392d29">Video</a></li>
<li><a href="#org10576c2">Feeds</a></li>
</ul>
</li>
<li><a href="#orgc18ff12">FFmpeg Scenecutter ⚠️ experimental ⚠️&#xa0;&#xa0;&#xa0;<span class="tag"><span class="disabled">disabled</span></span></a></li>
<li><a href="#org71493c9">Speak 🗣️</a></li>
</ul>
</li>
<li><a href="#org46bfd0c">AI - ChatGPT</a></li>
<li><a href="#orgad16946">Bifrost 🌈&#xa0;&#xa0;&#xa0;<span class="tag"><span class="disabled">disabled</span></span></a>
<ul>
<li>
<ul>
<li><a href="#orgecc5375">Client side (userscript)</a></li>
<li><a href="#org582df21">Server side (emacs)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3d67031">Look and feel 🎨</a>
<ul>
<li><a href="#org4ecdae9">Icons</a></li>
<li><a href="#org2b81aee">Dashboard</a></li>
<li><a href="#org59ea51a">Beautify</a></li>
<li><a href="#org30f2aae">Transparent Emacs</a></li>
<li><a href="#orgba1f3cf">Highlight line&#xa0;&#xa0;&#xa0;<span class="tag"><span class="disabled">disabled</span></span></a></li>
<li><a href="#orgd06b746">Themes</a></li>
<li><a href="#org4306551">Modeline</a></li>
<li><a href="#orgcf8804f">Headline</a></li>
</ul>
</li>
<li><a href="#org03f04e4">Networking</a>
<ul>
<li><a href="#orgfa932ac">Search</a></li>
<li><a href="#org33896e6">Browse Url</a></li>
<li><a href="#org2301c4e">Gopher and Gemini</a></li>
<li><a href="#org9d9d45d">HTTP Client</a></li>
</ul>
</li>
<li><a href="#orgdb56e4f">Multimedia 🎶</a>
<ul>
<li><a href="#org2fafc97">Bongo</a></li>
<li><a href="#org2fe0b62">Youtube</a></li>
<li><a href="#org0b58cfe">Pulseaudio interface</a></li>
</ul>
</li>
<li><a href="#orgad20350">News 📰 and Mail 📬</a>
<ul>
<li><a href="#orge89c95e">RSS</a></li>
<li><a href="#org8ce32f2">Mail</a>
<ul>
<li><a href="#orgeb1df01">Resources</a></li>
<li><a href="#orgbe871a5">Mu4e</a></li>
<li><a href="#orgd413de8">Gnus</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb77f04b">Utils ⚒️</a>
<ul>
<li><a href="#orgdf113ce">Password management</a></li>
<li><a href="#orgf98e3a2">Alarms and clock</a></li>
</ul>
</li>
<li><a href="#orga392ea1">File server&#xa0;&#xa0;&#xa0;<span class="tag"><span class="disabled">disabled</span></span></a></li>
<li><a href="#org6a401dc">Emacs and Desktop</a>
<ul>
<li><a href="#orgef5faa0">i3wm</a></li>
<li><a href="#orgc0fcefc">Emacs as Window Manager - EXWM</a>
<ul>
<li><a href="#org3700fc6">System configuration (Linux Mint/Ubuntu)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb53a3e5" class="outline-2">
<h2 id="orgb53a3e5">Minemacs core</h2>
<div class="outline-text-2" id="text-orgb53a3e5">
<div class="org-src-container">
<pre class="src src-elisp">(defun eval-replace-last-sexp ()
  (interactive)
  (let ((value (eval (preceding-sexp))))
    (kill-sexp -1)
    (insert (format "%S" value))))

(defun stringify (obj)
  (cond
   ((stringp obj) obj)
   ((symbolp obj) (symbol-name obj))
   (t (format "%s" obj))))

(defun async-shell-command-no-window (command)
  (interactive "sAsync shell command (no window): ")
  (let ((display-buffer-alist
           (list (cons shell-command-buffer-name-async (cons #'display-buffer-no-window nil)))))
    (async-shell-command command)))

(defvar minemacs--cache (make-hash-table :test 'equal))
(defvar minemacs-cache-directory (file-name-concat user-emacs-directory ".minemacs-cache"))

(defun minemacs-cache-file-name (id &amp;optional namespace)
  (expand-file-name (file-name-concat minemacs-cache-directory (stringify namespace) (md5 (stringify id)))))

(defun minemacs-cache-key (id &amp;optional namespace)
  (list :id id :namespace namespace))

(defun minemacs-cache-get (id &amp;optional namespace)
  (let* ((cache-key (minemacs-cache-file-name id namespace))
          (cache-value (gethash cache-key minemacs--cache)))
    (if cache-value cache-value (minemacs-cache-get-from-file id namespace))))

(defun minemacs-cache-get-from-file (id &amp;optional namespace)
  (let* ((cache-key (minemacs-cache-file-name id namespace)))
    (when (file-readable-p cache-key)
        (with-temp-buffer
          (insert-file-contents cache-key)
          ;;(cl-assert (eq (point) (point-min)))
          (read (current-buffer))))))

(defun minemacs-cache-set (id data &amp;optional namespace)
  (let* ((cache-key (minemacs-cache-file-name id namespace)))
    (puthash cache-key data minemacs--cache) data))

(defun minemacs-cache-set-to-file (id data &amp;optional namespace)
  (let* ((cache-key (minemacs-cache-file-name id namespace))
           (cache-base-dir (file-name-directory cache-key)))
    (mkdir cache-base-dir t)
    (with-temp-file cache-key (prin1 data (current-buffer)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd95bb0d" class="outline-2">
<h2 id="orgd95bb0d">Overrides</h2>
<div class="outline-text-2" id="text-orgd95bb0d">
</div>
<div id="outline-container-orgb0a66e0" class="outline-3">
<h3 id="orgb0a66e0">Bookmarks + browse-url</h3>
<div class="outline-text-3" id="text-orgb0a66e0">
<p>
Here add a custom bookmark handler relying on <code>browse-url</code> and <code>browse-url-handlers</code>, so even if we store a bookmark via <code>eww</code>, we're going to use the proper browser when opening it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'eww)
(require 'bookmark)
(defun browse-url-bookmark-jump (bookmark)
  "Bookmark jump handler: relies on =browse-url-handler= to pick the right browser.
  Define a custom jumper avoid to open always on EWW in case the bookmark was placed with it"
  (browse-url (bookmark-prop-get bookmark 'location)))
(defalias #'eww-bookmark-jump #'browse-url-bookmark-jump)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgabd7cf4" class="outline-2">
<h2 id="orgabd7cf4">Custom Helpers</h2>
<div class="outline-text-2" id="text-orgabd7cf4">
<div class="org-src-container">
<pre class="src src-elisp">(require 'cl-lib)
(require 'ucs-normalize)

(defun random-from-list (list)
  (nth (random (length list)) list))

(defun dashize (str)
  (cl-remove-if
   (lambda (char)
     (&gt; char 127))
   (ucs-normalize-NFKD-string (s-dashed-words str))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5910d2c" class="outline-2">
<h2 id="org5910d2c">Info and Help</h2>
<div class="outline-text-2" id="text-org5910d2c">
</div>
<div id="outline-container-orgf3e28bd" class="outline-3">
<h3 id="orgf3e28bd">Marginalia</h3>
<div class="outline-text-3" id="text-orgf3e28bd">
<div class="org-src-container">
<pre class="src src-elisp">;; Enable rich annotations using the Marginalia package
(use-package marginalia
  ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
  ;; available in the *Completions* buffer, add it to the
  ;; `completion-list-mode-map'.
  :bind (:map minibuffer-local-map
           ("M-A" . marginalia-cycle))

  ;; The :init section is always executed.
  :init

  ;; Marginalia must be activated in the :init section of use-package such that
  ;; the mode gets enabled right away. Note that this forces loading the
  ;; package.
  (marginalia-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org18a0868" class="outline-3">
<h3 id="org18a0868">Helpful&#xa0;&#xa0;&#xa0;<span class="tag"><span class="disabled">disabled</span></span></h3>
<div class="outline-text-3" id="text-org18a0868">
<div class="org-src-container">
<pre class="src src-elisp">(use-package helpful
  :bind
  ("C-h f" . #'helpful-callable)
  ("C-h v" . #'helpful-variable)
  ("C-h k" . #'helpful-key)
  ("C-h x" . #'helpful-command))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfeb27b7" class="outline-3">
<h3 id="orgfeb27b7">Show keybindings</h3>
<div class="outline-text-3" id="text-orgfeb27b7">
<div class="org-src-container">
<pre class="src src-elisp">(use-package which-key
  :config
  (which-key-mode 1))
</pre>
</div>
</div>
</div>
</div>
