emacs/modules.org
* Hail Hydra! 🐍                                               :wip:disabled:
:PROPERTIES:
:header-args: :tangle (minemacs-tangle-if-not-disabled "hydra.el") :mkdirp yes
:END:

#+begin_src elisp
  (use-package hydra
    :ensure t
    :init

    (defun send-key(key)
      (setq unread-command-events (listify-key-sequence key)))

    :config
    (defhydra hydra-nav (:color pink
			     :pre (setq cursor-type 'box)
			     :post (setq cursor-type 'bar))
	    "hydra-nav:"
	    ("w" #'kill-ring-save "w")
	    ("n" #'next-line "n")
	    ("p" #'previous-line "p")
	    ("a" #'beginning-of-line "a")
	    ("e" #'end-of-line "e")
	    ("<" #'beginning-of-buffer "<")
	    ("o" #'other-window "o")
	    (">" #'end-of-buffer ">")
	    ("u" #'undo "undo")
	    ("i" nil "quit"))

    (defhydra hydra-kommand (:color teal
				    :pre (setq cursor-type 'box)
				    :post (setq cursor-type 'bar))
	    "hydra-kommand"
	    ("k" #'execute-extended-command "🚀 Kommand")
	    ("m" #'hydra-nav/body "modal")
	    ("p" (lambda () (interactive) (send-key "\M-p")) "M-p")
	    ("n" (lambda () (interactive) (send-key "\M-n")) "M-n")
	    ("e" #'eval-defun "Λ eval-defun")
	    ("l" #'god-mode "👼 god")
	    ("r" #'repeat "repeat")
	    ("x" #'dabbrev-expand "expand")
	    ("b" #'ibuffer "🧰 ibuffer")
	    ("j" #'bookmark-jump "🔖 bookmark")
	    ("a" #'org-agenda)
	    ("q" nil "_q_uit"))
    :bind
    (("s-o" . #'hydra-kommand/body)
     ("s-l" . #'hydra-nav/body)))
#+end_src

* Helm 🛥️                                                           :disabled:

#+begin_src emacs-lisp
  (use-package helm
    :bind
    ("M-x" . #'helm-M-x)
    ("C-x C-f" . #'helm-find-files)
    ("C-x p" . #'helm-project)
    :config
    (helm-mode 1))
  (use-package helm-eww)
  (use-package helm-flycheck)
  (use-package helm-flymake)
  (use-package helm-flyspell)
  (use-package helm-frame)
  (use-package helm-project
    :custom
    (helm-project-map "C-x p"))
  (use-package helm-swoop
    :bind
    ("s-f" . #'helm-swoop))
  (use-package helm-wikipedia)
  (use-package helm-youtube)
#+end_src

* Eshell
** Functions

#+begin_src elisp
  (defun eshell/ve (&rest args)
    (let* ((cmd (car args))
	   (argv (cdr args))
	   (argl (string-join argv " ")))
      (if argv (eshell-exec-visual cmd argl) (eshell-exec-visual cmd))))
#+end_src

** Scripts

#+begin_src elisp :tangle ~/scripts/wallpaper-set.esh :mkdirp yes
  set wallpaper ${random-from-list ${ls ~/Pictures/wallpapers/*}}
  ln -sf $wallpaper  ~/Pictures/wallpaper
  feh --bg-fill ~/Pictures/wallpaper
#+end_src

* Imenu

#+begin_src elisp
  (use-package imenu
    :init
    (setq eww-imenu-heading-expression '((nil "^* +\\(.+\\)" 1))
	  eshell-imenu-commands-expression '((nil "\$ \\(\\w+\\)" 1)))
    :hook
    (eww-mode . (lambda () (setq imenu-generic-expression eww-imenu-heading-expression)))
    (eshell-mode . (lambda () (setq imenu-generic-expression eshell-imenu-commands-expression))))
#+end_src

* IDE 🖥️
:PROPERTIES:
:header-args: :tangle (minemacs-tangle-if-not-disabled "ide.el") :mkdirp yes
:END:

** MacOS compatibility

#+begin_src elisp
  (use-package exec-path-from-shell
    :config
    (exec-path-from-shell-initialize))
#+end_src

** Markup languages
*** Markdown

#+begin_src elisp
  (use-package markdown-mode)
#+end_src

** Consult

#+begin_src emacs-lisp
  (use-package consult
    ;; Replace bindings. Lazily loaded by `use-package'.
    :bind
    ("s-i" . #'consult-imenu)
    ("s-l" . #'consult-line)
    ("s-L" . #'consult-outline)
    ("C-x M-:" . #'consult-complex-command)
    ("C-x b" . #'consult-buffer)
    ("C-x 4 b" . #'consult-buffer-other-window)
    ("C-x 5 b" . #'consult-buffer-other-frame)
    ("C-x t b" . #'consult-buffer-other-tab)
    ("C-x r b" . #'consult-bookmark)
    ("C-x p b" . #'consult-project-buffer)
    ("M-#" . #'consult-register-load)
    ("M-'" . #'consult-register-store)
    ("C-M-#" . #'consult-register)
    ("M-y" . #'consult-yank-pop)
    ("M-g e" . #'consult-compile-error)
    ("M-g f" . #'consult-flymake)
    ("M-g g" . #'consult-goto-line)
    ("M-g M-g" . #'consult-goto-line)
    ("M-g o" . #'consult-outline)
    ("M-g m" . #'consult-mark)
    ("M-g k" . #'consult-global-mark)
    ("M-g i" . #'consult-imenu)
    ("M-g I" . #'consult-imenu-multi)
    ("M-s d" . #'consult-find)
    ("M-s c" . #'consult-locate)
    ("M-s g" . #'consult-grep)
    ("M-s G" . #'consult-git-grep)
    ("M-s r" . #'consult-ripgrep)
    ("M-s l" . #'consult-line)
    ("M-s L" . #'consult-line-multi)
    ("M-s k" . #'consult-keep-lines)
    ("M-s u" . #'consult-focus-lines)
    ("M-s e" . #'consult-isearch-history)
    (:map isearch-mode-map
    ("M-e" . #'consult-isearch-history)
    ("M-s e" . #'consult-isearch-history)
    ("M-s l" . #'consult-line)
    ("M-s L" . #'consult-line-multi))
    (:map minibuffer-local-map
    ("M-s" . #'consult-history)
    ("M-r" . #'consult-history)))

  (use-package embark-consult)
#+end_src

** Data serialization

#+begin_src elisp
  (use-package csv)
  (use-package csv-mode)
  (use-package yaml-mode)
#+end_src

** Programming languages
*** Elixir

#+begin_src elisp
  (use-package elixir-mode)
  (use-package exunit
    :hook
    (elixir-mode . exunit-mode))
  ;; Alchemist seems to be outdated and not more maintained
  ;; (use-package alchemist
  ;;   :config
  ;;   (add-to-list 'god-exempt-major-modes 'alchemist-test-report-mode))
#+end_src

Elixir Livebooks are Markdown files with =.livemd= extension. Let's handle them!

#+begin_src elisp
  (add-to-list 'auto-mode-alist '("\\.\\(?:md\\|markdown\\|mkd\\|mdown\\|mkdn\\|mdwn\\|livemd\\)\\'" . markdown-mode))
#+end_src

** Project

#+begin_src emacs-lisp
  (use-package project
    :config
    (defun minemacs-git-remote ()
      (interactive)
      (let* ((default-directory (project-root (project-current t)))
  	   (repository-url (vc-git-repository-url default-directory)))
        (kill-new repository-url)
        (message repository-url)))
    (add-to-list 'project-switch-commands '(project-shell "shell"))
    (add-to-list 'project-switch-commands '(minemacs-git-remote "Remote (git)" "R")))
#+end_src

** Versioning

#+begin_src elisp
  (use-package magit
  :bind
  (("C-x g" . #'magit-status)))
#+end_src

#+begin_src elisp
  (use-package diff-hl
    :config
    (diff-hl-mode 1))
#+end_src
** Docker

#+begin_src elisp
  (use-package docker)
  (use-package dockerfile-mode)
  (use-package docker-compose-mode)
#+end_src

