emacs/modules.html
<div id="outline-container-orgdd77928" class="outline-2">
<h2 id="orgdd77928">Hail Hydra! 🐍&#xa0;&#xa0;&#xa0;<span class="tag"><span class="wip">wip</span>&#xa0;<span class="disabled">disabled</span></span></h2>
<div class="outline-text-2" id="text-orgdd77928">
<div class="org-src-container">
<pre class="src src-elisp">(use-package hydra
  :ensure t
  :init

  (defun send-key(key)
    (setq unread-command-events (listify-key-sequence key)))

  :config
  (defhydra hydra-nav (:color pink
                             :pre (setq cursor-type 'box)
                             :post (setq cursor-type 'bar))
            "hydra-nav:"
            ("w" #'kill-ring-save "w")
            ("n" #'next-line "n")
            ("p" #'previous-line "p")
            ("a" #'beginning-of-line "a")
            ("e" #'end-of-line "e")
            ("&lt;" #'beginning-of-buffer "&lt;")
            ("o" #'other-window "o")
            ("&gt;" #'end-of-buffer "&gt;")
            ("u" #'undo "undo")
            ("i" nil "quit"))

  (defhydra hydra-kommand (:color teal
                                    :pre (setq cursor-type 'box)
                                    :post (setq cursor-type 'bar))
            "hydra-kommand"
            ("k" #'execute-extended-command "🚀 Kommand")
            ("m" #'hydra-nav/body "modal")
            ("p" (lambda () (interactive) (send-key "\M-p")) "M-p")
            ("n" (lambda () (interactive) (send-key "\M-n")) "M-n")
            ("e" #'eval-defun "Λ eval-defun")
            ("l" #'god-mode "👼 god")
            ("r" #'repeat "repeat")
            ("x" #'dabbrev-expand "expand")
            ("b" #'ibuffer "🧰 ibuffer")
            ("j" #'bookmark-jump "🔖 bookmark")
            ("a" #'org-agenda)
            ("q" nil "_q_uit"))
  :bind
  (("s-o" . #'hydra-kommand/body)
   ("s-l" . #'hydra-nav/body)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org62309f4" class="outline-2">
<h2 id="org62309f4">Helm 🛥️&#xa0;&#xa0;&#xa0;<span class="tag"><span class="disabled">disabled</span></span></h2>
<div class="outline-text-2" id="text-org62309f4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package helm
  :bind
  ("M-x" . #'helm-M-x)
  ("C-x C-f" . #'helm-find-files)
  ("C-x p" . #'helm-project)
  :config
  (helm-mode 1))
(use-package helm-eww)
(use-package helm-flycheck)
(use-package helm-flymake)
(use-package helm-flyspell)
(use-package helm-frame)
(use-package helm-project
  :custom
  (helm-project-map "C-x p"))
(use-package helm-swoop
  :bind
  ("s-f" . #'helm-swoop))
(use-package helm-wikipedia)
(use-package helm-youtube)
</pre>
</div>
</div>
</div>
<div id="outline-container-org3a05504" class="outline-2">
<h2 id="org3a05504">Eshell</h2>
<div class="outline-text-2" id="text-org3a05504">
</div>
<div id="outline-container-orgbc61786" class="outline-3">
<h3 id="orgbc61786">Functions</h3>
<div class="outline-text-3" id="text-orgbc61786">
<div class="org-src-container">
<pre class="src src-elisp">(defun eshell/ve (&amp;rest args)
  (let* ((cmd (car args))
           (argv (cdr args))
           (argl (string-join argv " ")))
    (if argv (eshell-exec-visual cmd argl) (eshell-exec-visual cmd))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org7cf7d45" class="outline-3">
<h3 id="org7cf7d45">Scripts</h3>
<div class="outline-text-3" id="text-org7cf7d45">
<div class="org-src-container">
<pre class="src src-elisp">set wallpaper ${random-from-list ${ls ~/Pictures/wallpapers/*}}
ln -sf $wallpaper  ~/Pictures/wallpaper
feh --bg-fill ~/Pictures/wallpaper
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbd9bb8f" class="outline-2">
<h2 id="orgbd9bb8f">Imenu</h2>
<div class="outline-text-2" id="text-orgbd9bb8f">
<div class="org-src-container">
<pre class="src src-elisp">(use-package imenu
  :init
  (setq eww-imenu-heading-expression '((nil "^* +\\(.+\\)" 1))
          eshell-imenu-commands-expression '((nil "\$ \\(\\w+\\)" 1)))
  :hook
  (eww-mode . (lambda () (setq imenu-generic-expression eww-imenu-heading-expression)))
  (eshell-mode . (lambda () (setq imenu-generic-expression eshell-imenu-commands-expression))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org631a714" class="outline-2">
<h2 id="org631a714">IDE 🖥️</h2>
<div class="outline-text-2" id="text-org631a714">
</div>
<div id="outline-container-org73bfd89" class="outline-3">
<h3 id="org73bfd89">MacOS compatibility</h3>
<div class="outline-text-3" id="text-org73bfd89">
<div class="org-src-container">
<pre class="src src-elisp">(use-package exec-path-from-shell
  :config
  (exec-path-from-shell-initialize))
</pre>
</div>
</div>
</div>
<div id="outline-container-org0503862" class="outline-3">
<h3 id="org0503862">Markup languages</h3>
<div class="outline-text-3" id="text-org0503862">
</div>
<div id="outline-container-org55bd23d" class="outline-4">
<h4 id="org55bd23d">Markdown</h4>
<div class="outline-text-4" id="text-org55bd23d">
<div class="org-src-container">
<pre class="src src-elisp">(use-package markdown-mode)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org61499bd" class="outline-3">
<h3 id="org61499bd">Consult</h3>
<div class="outline-text-3" id="text-org61499bd">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package consult
  ;; Replace bindings. Lazily loaded by `use-package'.
  :bind
  ("s-i" . #'consult-imenu)
  ("s-l" . #'consult-line)
  ("s-L" . #'consult-outline)
  ("C-x M-:" . #'consult-complex-command)
  ("C-x b" . #'consult-buffer)
  ("C-x 4 b" . #'consult-buffer-other-window)
  ("C-x 5 b" . #'consult-buffer-other-frame)
  ("C-x t b" . #'consult-buffer-other-tab)
  ("C-x r b" . #'consult-bookmark)
  ("C-x p b" . #'consult-project-buffer)
  ("M-#" . #'consult-register-load)
  ("M-'" . #'consult-register-store)
  ("C-M-#" . #'consult-register)
  ("M-y" . #'consult-yank-pop)
  ("M-g e" . #'consult-compile-error)
  ("M-g f" . #'consult-flymake)
  ("M-g g" . #'consult-goto-line)
  ("M-g M-g" . #'consult-goto-line)
  ("M-g o" . #'consult-outline)
  ("M-g m" . #'consult-mark)
  ("M-g k" . #'consult-global-mark)
  ("M-g i" . #'consult-imenu)
  ("M-g I" . #'consult-imenu-multi)
  ("M-s d" . #'consult-find)
  ("M-s c" . #'consult-locate)
  ("M-s g" . #'consult-grep)
  ("M-s G" . #'consult-git-grep)
  ("M-s r" . #'consult-ripgrep)
  ("M-s l" . #'consult-line)
  ("M-s L" . #'consult-line-multi)
  ("M-s k" . #'consult-keep-lines)
  ("M-s u" . #'consult-focus-lines)
  ("M-s e" . #'consult-isearch-history)
  (:map isearch-mode-map
  ("M-e" . #'consult-isearch-history)
  ("M-s e" . #'consult-isearch-history)
  ("M-s l" . #'consult-line)
  ("M-s L" . #'consult-line-multi))
  (:map minibuffer-local-map
  ("M-s" . #'consult-history)
  ("M-r" . #'consult-history)))

(use-package embark-consult)
</pre>
</div>
</div>
</div>
<div id="outline-container-org830350b" class="outline-3">
<h3 id="org830350b">Data serialization</h3>
<div class="outline-text-3" id="text-org830350b">
<div class="org-src-container">
<pre class="src src-elisp">(use-package csv)
(use-package csv-mode)
(use-package yaml-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9cc6d3b" class="outline-3">
<h3 id="org9cc6d3b">Programming languages</h3>
<div class="outline-text-3" id="text-org9cc6d3b">
</div>
<div id="outline-container-orgd977d36" class="outline-4">
<h4 id="orgd977d36">Elixir</h4>
<div class="outline-text-4" id="text-orgd977d36">
<div class="org-src-container">
<pre class="src src-elisp">(use-package elixir-mode)
(use-package exunit
  :hook
  (elixir-mode . exunit-mode))
;; Alchemist seems to be outdated and not more maintained
;; (use-package alchemist
;;   :config
;;   (add-to-list 'god-exempt-major-modes 'alchemist-test-report-mode))
</pre>
</div>

<p>
Elixir Livebooks are Markdown files with <code>.livemd</code> extension. Let's handle them!
</p>

<div class="org-src-container">
<pre class="src src-elisp">(add-to-list 'auto-mode-alist '("\\.\\(?:md\\|markdown\\|mkd\\|mdown\\|mkdn\\|mdwn\\|livemd\\)\\'" . markdown-mode))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgffc86bd" class="outline-3">
<h3 id="orgffc86bd">Project</h3>
<div class="outline-text-3" id="text-orgffc86bd">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package project
  :config
  (defun minemacs-git-remote ()
    (interactive)
    (let* ((default-directory (project-root (project-current t)))
           (repository-url (vc-git-repository-url default-directory)))
      (kill-new repository-url)
      (message repository-url)))
  (add-to-list 'project-switch-commands '(project-shell "shell"))
  (add-to-list 'project-switch-commands '(minemacs-git-remote "Remote (git)" "R")))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga9c5533" class="outline-3">
<h3 id="orga9c5533">Versioning</h3>
<div class="outline-text-3" id="text-orga9c5533">
<div class="org-src-container">
<pre class="src src-elisp">(use-package magit
:bind
(("C-x g" . #'magit-status)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(use-package diff-hl
  :config
  (diff-hl-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga6fcfa4" class="outline-3">
<h3 id="orga6fcfa4">Docker</h3>
<div class="outline-text-3" id="text-orga6fcfa4">
<div class="org-src-container">
<pre class="src src-elisp">(use-package docker)
(use-package dockerfile-mode)
(use-package docker-compose-mode)
</pre>
</div>
</div>
</div>
