emacs/modules.org
** Workspaces                                                       :disabled:

#+begin_src elisp
  (use-package tabspaces
    :hook (after-init . tabspaces-mode)
    :commands (tabspaces-switch-or-create-workspace
  	     tabspaces-open-or-create-project-and-workspace)
    :bind
    (("s-q" . #'tab-switch)
     ("s-{" . #'tab-previous)
     ("s-}" . #'tab-next))
    :custom
    (tabspaces-keymap-prefix "C-x t w")
    (tabspaces-use-filtered-buffers-as-default t)
    (tabspaces-default-tab "Default")
    (tabspaces-remove-to-default t)
    (tabspaces-initialize-project-with-todo t)
    (tabspaces-todo-file-name "project-todo.org")
    ;; I don't want tabspaces to manage sessions, so I keep those lines commented out.
    ;; (tabspaces-session t)
    ;; (tabspaces-session-auto-restore t))
    )
#+end_src

** Templating

#+begin_src elisp
  (use-package yasnippet
    :custom
    (yas-snippet-dirs '("~/Dropbox/minemacs/snippets"))
    :config
    (yas-global-mode 1))

  (use-package yasnippet-snippets
    :after yasnippet)
#+end_src

** Terminal

Here install =vterm= and some  useful functions to ease interaction with *Tmux*.

#+begin_src elisp
  (use-package vterm
    :after god-mode
    :config
    (require 'god-mode)
    (add-to-list 'god-exempt-major-modes 'vterm-mode)

    (defun minemacs-vterm-exec (command)
      (interactive "sCommand: ")
      (let ((buffer-name (format "*vterm <%s>*" command)))
	(with-current-buffer (vterm buffer-name)
	(vterm-send-string (format "%s && exit\n" command)))))

    (defun minemacs-tmux/open ()
      (interactive)
      (minemacs-vterm-exec "tmux attach || tmux")))
#+end_src

** [[https://cht.sh/][cht.sh]]

#+begin_src sh :tangle no
curl https://cht.sh 
#+end_src

#+begin_src elisp
  (defun cht.sh-help (helpable)
    (interactive "sHelp: ")
    (cht.sh-query "/:help"))

  (defun cht.sh-list ()
    (interactive)
    (cht.sh-query "/:list"))

  (defun cht.sh-query (query)
    (interactive "sQuery: ")
    (let ((cmd (format "curl https://cht.sh/%s" query))
  	(buffer-name (format "*cht-sh* <%s>" query)))
      (async-shell-command cmd buffer-name)))
#+end_src

** Github API

In order to make the authentication work remember to add your Github username and API token in the =~/.authinfo.gpg=; also customize =minemacs-github-api-username= in order to match the auth source entry.

#+begin_example authinfo
  machine api.github.com login YOUR@EMAIL.COM password YOUR-GITHUB-API-TOKEN port 80
#+end_example

#+begin_src emacs-lisp
  (defcustom minemacs-github-api-username nil "Your Github username (email)" :type '(string))

  (defun minemacs-github-api-token ()
    (if-let* ((matched (auth-source-search :host "api.github.com" :login minemacs-github-api-username :port 80))
	      (auth (car matched)))
	(funcall (plist-get auth :secret))))

  (defun minemacs-github--display-repos (repos)
    (with-current-buffer (get-buffer-create "test")
      (erase-buffer)
      (seq-doseq (repo repos)
	(let ((name (gethash "full_name" repo)))
	  (insert (format "=> %s\n" name))))
      (pop-to-buffer (current-buffer))))

  (defun minemacs-github--fetch-repos ()
    (let* ((token-header (format "token %s" (minemacs-github-api-token)))
	   (url-request-extra-headers `(
					("Content-Type" . "application/json")
					("Authorization" . ,token-header))))
      (with-temp-buffer
	(url-insert-file-contents "https://api.github.com/user/repos")
	(minemacs-github--display-repos (json-parse-buffer)))))

  (defun minemacs-github-repos ()
    (interactive)
    (minemacs-github--fetch-repos))
#+end_src

* Knowledge base and second brain

#+begin_src emacs-lisp
  (use-package org-roam)
#+end_src

Here's a snippet that sould migrate all your plain =org= files into the =org-roam= system.

#+begin_src emacs-lisp :tangle no
  (dolist (file (directory-files org-roam-directory t "\\.org"))
    (with-current-buffer (find-file-noselect file)
      (org-id-get-create)
      (save-buffer)
      (kill-buffer)))
#+end_src

* Jarvis 🤖
:PROPERTIES:
:header-args: :tangle (minemacs-tangle-if-not-disabled "jarvis.el") :mkdirp yes
:END:

Jarvis is a module that enables some high-level/automation features.

** Youtube 🎥
*** Helper functions

Given a Youtuve channel URL, returns the channel ID. This is  useful in cases like when you want to get the RSS feed of a Youtube channel.

#+begin_src elisp
  (defun jarvis-youtube-get-channel-rss (url &optional action)
    "Given a Youtube channel URL, returns the RSS feed of a Youtube channel."
    (interactive "sYoutube channel url: ")
    (let* ((action (or action current-prefix-arg 0))
  	 (url-user-agent "curl/8.7.1")
  	 (url-request-extra-headers '(("Accept" . "*/*")))
  	 (buffer (url-retrieve-synchronously url))
  	 (feed-url (with-current-buffer buffer
  		     (let* ((dom (libxml-parse-html-region))
  			    (link (dom-search dom
  					      (lambda (el)
  						(and (string= (dom-tag el) "link")
  						     (string= (dom-attr el 'itemprop) "url")))))
  			    (channel-id-url (and link (dom-attr link 'href))))
  		       (if channel-id-url
  			   (let* ((_ (string-match "/channel/\\(\\w+\\)" channel-id-url))
  				  (id (match-string 1 channel-id-url)))
  			     (pop-to-buffer (current-buffer))
  			     (format "https://www.youtube.com/feeds/videos.xml?channel_id=%s" id)))))))
      (message "Youtube URL: %s has RSS feed url %s" url feed-url)
      (cond ((= action 1) (kill-new feed-url))
  	  ((= action 2) (insert feed-url))
  	  (t feed-url))))
#+end_src

#+begin_src emacs-lisp
  (defun jarvis-get-rss-urls (url)
    "Given a URL, tries to fetch the RSS feed URL."
    (interactive "URL: ")
    (let* ((url-user-agent "curl/8.7.1")
  	 (url-request-extra-headers '(("Accept" . "*/*")))
  	 (buffer (url-retrieve-synchronously url))
  	 (feeds (with-current-buffer buffer
  		      (let* ((dom (libxml-parse-html-region))
  			     (links (dom-search dom
  					       (lambda (el)
  						 (and (string= (dom-tag el) "link")
  						      (string= (dom-attr el 'type) "application/rss+xml"))))))
  			links)))
  	 (feeds-count (length feeds)))
      (if (> feeds-count 0)
  	(let ((result-buffer (get-buffer-create (format "*get-rss-urls <%s>*" url))))
  	  (with-current-buffer result-buffer
  	    (let ((tabulated-list-format [("Title" 18 t)
  					  ("URL" 12 nil)])
  		  (tabulated-list-padding 2)
  		  (tabulated-list-entries (mapcar
  					   (lambda (feed)
  					     (let ((feed-title (dom-attr feed 'title))
  						   (feed-url (dom-attr feed 'href)))
  					       (list nil (vector feed-title feed-url))))
  					   feeds)))
  	      (tabulated-list-mode)
  	      (tabulated-list-print)))
  	  (pop-to-buffer result-buffer))
        (prog2 (message "No RSS found for %s" url) nil))))
#+end_src

