emacs/modules.html
<div id="outline-container-org398fa15" class="outline-3">
<h3 id="org398fa15">Workspaces&#xa0;&#xa0;&#xa0;<span class="tag"><span class="disabled">disabled</span></span></h3>
<div class="outline-text-3" id="text-org398fa15">
<div class="org-src-container">
<pre class="src src-elisp">(use-package tabspaces
  :hook (after-init . tabspaces-mode)
  :commands (tabspaces-switch-or-create-workspace
             tabspaces-open-or-create-project-and-workspace)
  :bind
  (("s-q" . #'tab-switch)
   ("s-{" . #'tab-previous)
   ("s-}" . #'tab-next))
  :custom
  (tabspaces-keymap-prefix "C-x t w")
  (tabspaces-use-filtered-buffers-as-default t)
  (tabspaces-default-tab "Default")
  (tabspaces-remove-to-default t)
  (tabspaces-initialize-project-with-todo t)
  (tabspaces-todo-file-name "project-todo.org")
  ;; I don't want tabspaces to manage sessions, so I keep those lines commented out.
  ;; (tabspaces-session t)
  ;; (tabspaces-session-auto-restore t))
  )
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdd5744e" class="outline-3">
<h3 id="orgdd5744e">Templating</h3>
<div class="outline-text-3" id="text-orgdd5744e">
<div class="org-src-container">
<pre class="src src-elisp">(use-package yasnippet
  :custom
  (yas-snippet-dirs '("~/Dropbox/minemacs/snippets"))
  :config
  (yas-global-mode 1))

(use-package yasnippet-snippets
  :after yasnippet)
</pre>
</div>
</div>
</div>
<div id="outline-container-org21d3b20" class="outline-3">
<h3 id="org21d3b20">Terminal</h3>
<div class="outline-text-3" id="text-org21d3b20">
<p>
Here install <code>vterm</code> and some  useful functions to ease interaction with <b>Tmux</b>.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(use-package vterm
  :after god-mode
  :config
  (require 'god-mode)
  (add-to-list 'god-exempt-major-modes 'vterm-mode)

  (defun minemacs-vterm-exec (command)
    (interactive "sCommand: ")
    (let ((buffer-name (format "*vterm &lt;%s&gt;*" command)))
        (with-current-buffer (vterm buffer-name)
        (vterm-send-string (format "%s &amp;&amp; exit\n" command)))))

  (defun minemacs-tmux/open ()
    (interactive)
    (minemacs-vterm-exec "tmux attach || tmux")))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd7efe7e" class="outline-3">
<h3 id="orgd7efe7e"><a href="https://cht.sh/">cht.sh</a></h3>
<div class="outline-text-3" id="text-orgd7efe7e">
<div class="org-src-container">
<pre class="src src-sh">curl https://cht.sh 
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(defun cht.sh-help (helpable)
  (interactive "sHelp: ")
  (cht.sh-query "/:help"))

(defun cht.sh-list ()
  (interactive)
  (cht.sh-query "/:list"))

(defun cht.sh-query (query)
  (interactive "sQuery: ")
  (let ((cmd (format "curl https://cht.sh/%s" query))
        (buffer-name (format "*cht-sh* &lt;%s&gt;" query)))
    (async-shell-command cmd buffer-name)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb7e117a" class="outline-3">
<h3 id="orgb7e117a">Github API</h3>
<div class="outline-text-3" id="text-orgb7e117a">
<p>
In order to make the authentication work remember to add your Github username and API token in the <code>~/.authinfo.gpg</code>; also customize <code>minemacs-github-api-username</code> in order to match the auth source entry.
</p>

<pre class="example" id="orga0729eb">
machine api.github.com login YOUR@EMAIL.COM password YOUR-GITHUB-API-TOKEN port 80
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom minemacs-github-api-username nil "Your Github username (email)" :type '(string))

(defun minemacs-github-api-token ()
  (if-let* ((matched (auth-source-search :host "api.github.com" :login minemacs-github-api-username :port 80))
              (auth (car matched)))
        (funcall (plist-get auth :secret))))

(defun minemacs-github--display-repos (repos)
  (with-current-buffer (get-buffer-create "test")
    (erase-buffer)
    (seq-doseq (repo repos)
        (let ((name (gethash "full_name" repo)))
          (insert (format "=&gt; %s\n" name))))
    (pop-to-buffer (current-buffer))))

(defun minemacs-github--fetch-repos ()
  (let* ((token-header (format "token %s" (minemacs-github-api-token)))
           (url-request-extra-headers `(
                                        ("Content-Type" . "application/json")
                                        ("Authorization" . ,token-header))))
    (with-temp-buffer
        (url-insert-file-contents "https://api.github.com/user/repos")
        (minemacs-github--display-repos (json-parse-buffer)))))

(defun minemacs-github-repos ()
  (interactive)
  (minemacs-github--fetch-repos))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7254803" class="outline-2">
<h2 id="org7254803">Knowledge base and second brain</h2>
<div class="outline-text-2" id="text-org7254803">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-roam)
</pre>
</div>

<p>
Here's a snippet that sould migrate all your plain <code>org</code> files into the <code>org-roam</code> system.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(dolist (file (directory-files org-roam-directory t "\\.org"))
  (with-current-buffer (find-file-noselect file)
    (org-id-get-create)
    (save-buffer)
    (kill-buffer)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd5ca3fc" class="outline-2">
<h2 id="orgd5ca3fc">Jarvis 🤖</h2>
<div class="outline-text-2" id="text-orgd5ca3fc">
<p>
Jarvis is a module that enables some high-level/automation features.
</p>
</div>
<div id="outline-container-org4e3e158" class="outline-3">
<h3 id="org4e3e158">Youtube 🎥</h3>
<div class="outline-text-3" id="text-org4e3e158">
</div>
<div id="outline-container-org3ddf1b2" class="outline-4">
<h4 id="org3ddf1b2">Helper functions</h4>
<div class="outline-text-4" id="text-org3ddf1b2">
<p>
Given a Youtuve channel URL, returns the channel ID. This is  useful in cases like when you want to get the RSS feed of a Youtube channel.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(defun jarvis-youtube-get-channel-rss (url &amp;optional action)
  "Given a Youtube channel URL, returns the RSS feed of a Youtube channel."
  (interactive "sYoutube channel url: ")
  (let* ((action (or action current-prefix-arg 0))
         (url-user-agent "curl/8.7.1")
         (url-request-extra-headers '(("Accept" . "*/*")))
         (buffer (url-retrieve-synchronously url))
         (feed-url (with-current-buffer buffer
                     (let* ((dom (libxml-parse-html-region))
                            (link (dom-search dom
                                              (lambda (el)
                                                (and (string= (dom-tag el) "link")
                                                     (string= (dom-attr el 'itemprop) "url")))))
                            (channel-id-url (and link (dom-attr link 'href))))
                       (if channel-id-url
                           (let* ((_ (string-match "/channel/\\(\\w+\\)" channel-id-url))
                                  (id (match-string 1 channel-id-url)))
                             (pop-to-buffer (current-buffer))
                             (format "https://www.youtube.com/feeds/videos.xml?channel_id=%s" id)))))))
    (message "Youtube URL: %s has RSS feed url %s" url feed-url)
    (cond ((= action 1) (kill-new feed-url))
          ((= action 2) (insert feed-url))
          (t feed-url))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun jarvis-get-rss-urls (url)
  "Given a URL, tries to fetch the RSS feed URL."
  (interactive "URL: ")
  (let* ((url-user-agent "curl/8.7.1")
         (url-request-extra-headers '(("Accept" . "*/*")))
         (buffer (url-retrieve-synchronously url))
         (feeds (with-current-buffer buffer
                      (let* ((dom (libxml-parse-html-region))
                             (links (dom-search dom
                                               (lambda (el)
                                                 (and (string= (dom-tag el) "link")
                                                      (string= (dom-attr el 'type) "application/rss+xml"))))))
                        links)))
         (feeds-count (length feeds)))
    (if (&gt; feeds-count 0)
        (let ((result-buffer (get-buffer-create (format "*get-rss-urls &lt;%s&gt;*" url))))
          (with-current-buffer result-buffer
            (let ((tabulated-list-format [("Title" 18 t)
                                          ("URL" 12 nil)])
                  (tabulated-list-padding 2)
                  (tabulated-list-entries (mapcar
                                           (lambda (feed)
                                             (let ((feed-title (dom-attr feed 'title))
                                                   (feed-url (dom-attr feed 'href)))
                                               (list nil (vector feed-title feed-url))))
                                           feeds)))
              (tabulated-list-mode)
              (tabulated-list-print)))
          (pop-to-buffer result-buffer))
      (prog2 (message "No RSS found for %s" url) nil))))
</pre>
</div>
</div>
</div>
