emacs/modules.html
<div id="outline-container-org617d101" class="outline-4">
<h4 id="org617d101">Simple helpers: (randomly) pick and open a Youtube page in browser (or mpv)</h4>
<div class="outline-text-4" id="text-org617d101">
<p>
Simply open pick or randomly select a Youtube video from a list. Open in browser or using <code>mpv</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(defcustom jarvis/youtube-sources '()
  "List of some Youtube videos; `jarvis/play-youtube` will pick one of them, randomly, and open it"
  :type '(repeat (list :tag "sources" (string :tag "title") (string :tag "url"))))

(defun jarvis/play-youtube (&amp;optional url)
  "Randomly pick one of the videos defined in `jarvis/youtube-sources` and then play it."
  (interactive (let ((entries (make-hash-table :test 'equal)))
                   (dolist (entry jarvis/youtube-sources)
                     (puthash (-first-item entry) (-second-item entry) entries))
                   (list (gethash (completing-read "URL: " entries) entries))))
  (empv-play url))

(defun jarvis/open-random-youtube ()
  "Open in mpv one of the sources in `jarvis/youtube-sources` and then open it."
  (interactive)
  (let ((entry (minemacs-random jarvis/youtube-sources))
          (url (nth 1 entry)))
    (jarvis/open-youtube url)))

(defun jarvis/open-youtube (&amp;optional url)
  "Open in browser one of the sources in `jarvis/youtube-sources`."
  (interactive (list (completing-read "URL: " (mapcar (lambda (entry) (nth 1 entry)) jarvis/youtube-sources))))
  (browse-url-default-browser url))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgff41ee6" class="outline-4">
<h4 id="orgff41ee6">Experimenting with the Google APIs (<a href="https://developers.google.com/apis-explorer?hl=it">here's the doc</a>).</h4>
<div class="outline-text-4" id="text-orgff41ee6">
<div class="org-src-container">
<pre class="src src-elisp">(use-package request)

(defcustom jarvis/youtube-api-key "" "Youtube API key")
(cl-defstruct (youtube-video (:constructor youtube-video-create)
                               (:copier nil))
  id title desc url channel channel-url categories tags)

(defun jarvis/youtube-search (query)
  "Returns a list of youtube vidoes given a search term."
  (interactive "sSearch: ")
  (request "https://www.googleapis.com/youtube/v3/search"
    :params `(("key" . ,jarvis/youtube-api-key) ("maxResults" . 3))
    :parser 'json-read
    :success (cl-function
                (lambda (&amp;key data &amp;allow-other-keys)
                  (when data
                    (with-current-buffer (get-buffer-create "*youtube-vids*")
                      (erase-buffer)
                      (insert (prin1-to-string data))
                      (pop-to-buffer (current-buffer))))))))

(defun jarvis/youtube-video (url)
  "Returns details about a Youtube video given an URL"
  (interactive "sURL: ")
  (let ((id (jarvis/youtube--extract-id url)))
    (request "https://www.googleapis.com/youtube/v3/videos"
        :params `(("id" . ,id) ("key" . ,jarvis/youtube-api-key) ("maxResults" . 1) ("part" . "snippet,contentDetails,statistics,topicDetails,status,localizations"))
        :parser 'json-read
        :success (cl-function
                  (lambda (&amp;key data &amp;allow-other-keys)
                    (when data
                      (let* ((items (alist-get 'items data))
                             (video-data (elt items 0))
                             (video (let-alist video-data
                                      (youtube-video-create
                                       :title .snippet.title
                                       :url .snippet.webpage-url
                                       :channel .snippet.channel
                                       :channel-url .snippet.channel-url
                                       :categories .snippet.categories
                                       :tags .snippet.tags
                                       :desc .snippet.description)))
                             (buffer-name "*yt-vid*")) ; (normalize-string (youtube-video-title video))))
                        (with-current-buffer (get-buffer-create buffer-name)
                          (erase-buffer)
                          (insert (prin1-to-string video-data))
                          ;; (insert (format "# [%s](%s)" (youtube-video-title video) (youtube-video-url video)))
                          ;; (insert ?\n)
                          ;; (insert (format "From [%s](%s)\n" (youtube-video-channel video) (youtube-video-channel-url video)))
                          ;; (insert (youtube-video-desc video))
                          (beginning-of-buffer)
                          (pop-to-buffer (current-buffer))))))))))

(defun normalize-string (str)
  (require 'cl-lib)
  (require 'ucs-normalize)
  (let* ((dstr (downcase str))
           (fstr (cl-remove-if
                 (lambda (char)
                   (&gt; char 127))
                 (ucs-normalize-NFKD-string dstr))))
    fstr))

(defun jarvis/youtube--extract-id (string)
  "Extract the id from a Youtube video URL"
  (let ((match-data (string-match "\\(\\ca\\{11\\}\\)\$" string)))
    (match-string 1 string)))
</pre>
</div>
</div>
</div>
</div>
