emacs/modules.html
<div id="outline-container-org10576c2" class="outline-4">
<h4 id="org10576c2">Feeds</h4>
<div class="outline-text-4" id="text-org10576c2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom jarvis-feeds-collector-directory "~/Dropbox/feeds/"
  "Base directory where to put the collected feeds."
  :type '(directory))

(defun jarvis-feeds--extract-authors-names (entry)
  (if-let* ((meta (elfeed-entry-meta entry))
            (authors (plist-get meta :authors)))
      (mapcar (lambda (author) (plist-get author :name)) authors)))

(defun jarvis-feeds--insert-buffer-content (entry buffer)
  (let* ((feed (elfeed-entry-feed entry))
         (feed-title (elfeed-feed-title feed))
         (url (elfeed-entry-link entry))
         (title (elfeed-entry-title entry))
         (authors (jarvis-feeds--extract-authors-names entry))
         (date (format-time-string "%F %R" (elfeed-entry-date entry)))
         (tags (mapcar (lambda (tag) (symbol-name tag)) (or (elfeed-entry-tags entry) '(untagged))))
         (base (and feed (elfeed-compute-base (elfeed-feed-url feed))))
         (type (elfeed-entry-content-type entry))
         (entry-content (elfeed-deref (elfeed-entry-content entry))))
    (with-current-buffer buffer
      (insert (format "#+TITLE: %s\n" title))
      (dolist (author authors)
        (insert (format "#+AUTHOR: %s\n" author)))
      (insert (format "#+DATE: &lt;%s&gt;\n" date))
      (insert (format "#+FILETAGS: %s\n\n" (org-make-tag-string tags)))
      (insert (format "* [[%s][%s]]\n\n" url title))
      (if entry-content
          (if (eq type 'html)
              (elfeed-insert-html entry-content base)
            (insert entry-content))
        (insert (propertize "(empty)\n" 'face 'italic))))))

(defun jarvis-feeds--build-entry-pathname (entry &amp;optional ext)
  (let* ((ext (or ext "org"))
         (name (dashize (elfeed-entry-title entry)))
         (date (elfeed-entry-date entry))
         (year (format-time-string "%+4Y" date))
         (month (format-time-string "%m" date))
         (day (format-time-string "%d" date))
         (date-str (format-time-string "%F-%H%M%S" date))
         (filename (format "%s/%s/%s/%s-%s.%s" year month day date-str name ext)))
    (expand-file-name filename jarvis-feeds-collector-directory)))

(defun jarvis-feeds--create-entry-file (entry &amp;optional force)
  (let* ((pathname (jarvis-feeds--build-entry-pathname entry))
         (coding-system-for-write 'raw-text)
         (base-dir (file-name-directory pathname))
         (already-collected (member 'collected (elfeed-entry-tags entry))))
    (when (or force (and (not already-collected) (not (file-exists-p pathname))))
      (mkdir base-dir t)
      (with-temp-file pathname
        (set-buffer-file-coding-system 'raw-text)
        (jarvis-feeds--insert-buffer-content entry (current-buffer)))
      (message "Jarvis/Feeds: collected %s" pathname)
      (elfeed-tag entry 'collected)
      pathname)))

(defun jarvis-feeds-collect-feed (entry)
  (interactive (list
                (or (and (boundp 'elfeed-show-entry) elfeed-show-entry)
                    (elfeed-search-selected :ignore-region))))
  (when (elfeed-entry-p entry)
    (let ((pathname (jarvis-feeds--create-entry-file elfeed-show-entry t)))
      (when (called-interactively-p 'any)
        (find-file pathname)))))

(defun jarvis-feeds-bulk-collect (limit)
  (interactive "NFeed entries to collect: ")
  (let* ((count 0))
    (with-elfeed-db-visit (entry _feed)
      (setq count (1+ count))
      (jarvis-feeds--create-entry-file entry)
      (when (= count limit)
        (elfeed-db-return (list :ok count))))))
</pre>
</div>

<p>
You can call <code>jarvis-feeds-collect-feed</code> while you're in an elfeed entry or call the bulk version. Otherwise you can use the custom elfeed hook to automatically add every new entry.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'elfeed-new-entry-hook #'jarvis-feeds-collect-feed)
</pre>
</div>
</div>
</div>
</div>
