emacs/modules.org
** FFmpeg Scenecutter ⚠️ experimental ⚠️                             :disabled:

#+begin_src emacs-lisp
  (defun jarvis-scenecutter--add-scene (proc pts duration pts-time duration-time)
    (message "Adding scene pts:%s duration:%s pts-time:%s duration-time:%s" pts duration pts-time duration-time)
    (let* ((scene (list :pts pts :duration duration :pts-time pts-time :duration-time duration-time))
	   (data (gethash proc jarvis-scenecutter--scenes))
	   (scenes (plist-get data :scenes))
	   (new-scenes (append scenes (list scene))))
      (puthash proc (plist-put data :scenes new-scenes) jarvis-scenecutter--scenes)))

  (defun jarvis-scenecutter--parse-scenes (proc input)
    (when (string-match "Parsed_showinfo" input)
      (let* ((_ (string-match "pts:\s*\\([[:alnum:]\|\.]+\\)" input))
	     (pts (match-string 1 input))
	     (_ (string-match "duration:\s*\\([[:alnum:]\|\.]+\\)" input))
	     (duration (match-string 1 input))
	     (_ (string-match "pts_time:\s*\\([[:alnum:]\|\.]+\\)" input))
	     (pts-time (match-string 1 input))
	     (_ (string-match "duration_time:\s*\\([[:alnum:]\|\.]+\\)" input))
	     (duration-time (match-string 1 input)))
	(and pts duration pts-time duration-time
	     (jarvis-scenecutter--add-scene proc
					    (string-to-number pts)
					    (string-to-number duration)
					    (string-to-number pts-time)
					    (string-to-number duration-time))))))

  (defun jarvis-scenecutter--create-scene-async (file scene index)
    (let* ((name (file-name-sans-extension (file-name-base file)))
	   (ext (file-name-extension file))
	   (scenes-dir (file-name-sans-extension file))
	   (scene-file (file-name-concat scenes-dir (format "%s-scene-%s.%s" name index ext)))
	   (start (plist-get scene :pts))
	   (duration (plist-get scene :duration))
	   (cmd
	    (format
	     "ffmpeg -i %s -ss %s -t %s %s"
	     file start duration scene-file)))
      (message "Creating scene via: %s" cmd)
      ;;(mkdir scenes-dir t)
      ;;(call-process-shell-command cmd nil 0)))
      ))

  (defun jarvis-scenecutter--create-scene-thumb (file thumb-seek thumb-file)
    (let* ((cmd (format "ffmpeg -i %s -ss %sms -frames:v 1 %s" file thumb-seek thumb-file))
	   (thumb-width 660)
	   (thumb-org-code (format "#+ATTR_HTML: width=\"%spx\"\n#+ATTR_ORG: :width %s\n[[%s]]\n" thumb-width thumb-width thumb-file))
	   (proc (make-process
		  :name thumb-file
		  :command (list "ffmpeg" "-i" file "-ss" (format "%sms" thumb-seek) "-frames:v" "1" thumb-file)
		  :buffer nil
		  :sentinel (lambda (proc event)
			      (and (equal "finished\n" event)
				   (let* ((entry (minemacs-cache-get proc))
					  (buffer (car entry))
					  (point (cdr entry)))
				     (when buffer (with-current-buffer buffer (org-redisplay-inline-images) (goto-char point)))
				     ;; remove cache entry
				     ))))))
      (minemacs-cache-set proc (cons (current-buffer) (point)))
      thumb-org-code))

  (defun jarvis-scenecutter--create-scenes-thumbs (file scenes thumb-files-template)
    (let* ((scenes-params (string-join (cons "eq(n\\,0)" (mapcar (lambda (scene) (format "eq(n\\,%d)" (plist-get scene :pts))) scenes)) "+"))
	   (cmd (list "ffmpeg" "-i" file "-vf" (format "select='%s'" scenes-params) "-frame_pts" "1" "-vsync" "0" thumb-files-template))
	   (proc (make-process
		  :name (format "scenecutter-%s" file)
		  :command cmd
		  :buffer nil
		  :sentinel (lambda (proc event)
			      (and (equal "finished\n" event)
				   (let ((buffer (minemacs-cache-get proc)))
				     (when buffer (with-current-buffer buffer (org-redisplay-inline-images)))
				     ;; remove cache entry
				     ))))))
      (minemacs-cache-set proc (current-buffer))))

  (defun jarvis-scenecutter--create-scenes-index (file scenes)
    (let* ((default-directory (file-name-directory file))
	   (name (file-name-sans-extension (file-name-base file)))
	   (scenes-index-file (file-name-concat default-directory (format "%s-scenes.org" name)))
	   (buffer (find-file-noselect scenes-index-file))
	   (title (format "%s scenes index" name))
	   (thumb-width 660))
      (with-current-buffer buffer
	(jarvis-scenecutter--create-scenes-thumbs file scenes (format "%s-scene-%%d.png" name))
	(erase-buffer)
	(insert "# -*- org-image-actual-width: nil; eval: (org-display-inline-images); -*-\n")
	(insert (format "#+TITLE: %s\n#+STARTUP: content\n\n" title))
	(insert (format "* Scenes for %s\n\n" file))
	(let ((first-scene (car scenes))
	      (reduce-fun (lambda (prev-scene scene)
			    (let* ((seek-start (plist-get prev-scene :pts))
				   (seek-end (plist-get scene :pts))
				   (thumb-seek (+ seek-start 10))
				   (scene-file (file-name-concat default-directory (format "%s-scene-%s.mp4" name seek-start)))
				   (thumb-file (file-name-concat default-directory (format "%s-scene-%s.png" name seek-start))))
			      ;; (insert (format "%s\n\n" (prin1-to-string scene)))
			      (insert (format "** %s -- %s\n\n" seek-start seek-end))

			      (insert "#+begin_src emacs-lisp :results output raw replace\n")
			      (insert (format "(jarvis-scenecutter--create-scene-thumb \"%s\" %s \"%s\")\n" file seek-start thumb-file))
			      (insert "#+end_src\n\n")

			      (insert (format "#+RESULTS:\n#+ATTR_HTML: width=\"%spx\"\n#+ATTR_ORG: :width %s\n[[%s]]\n\n" thumb-width thumb-width thumb-file))

			      (insert "#+begin_src sh :results silent\n")
			      (insert (format "ffmpeg -y -accurate_seek -i %s -ss %sus -to %sus %s\n" file seek-start seek-end scene-file))
			      (insert "#+end_src\n\n")
			      scene))))
	  (seq-reduce reduce-fun scenes (list :pts 0)))
	(basic-save-buffer)
	(beginning-of-buffer)
	(pop-to-buffer buffer))))

  (defun jarvis-scenecutter--cache-key (file)
    (file-name-sans-extension (file-name-base (expand-file-name file))))

  (defun jarvis-scenecutter--cache-scenes-load (file)
    (minemacs-cache-get (jarvis-scenecutter--cache-key file) :jarvis-scenecutter))

  (defun jarvis-scenecutter--cache-scenes-save (file data)
    (minemacs-cache-set (jarvis-scenecutter--cache-key file) data :jarvis-scenecutter))

  (defun jarvis-scenecutter--process-scenes (file scenes)
    (message "Processing scenes for %s" file)
    (jarvis-scenecutter--create-scenes-index file scenes)
    ;; (seq-do-indexed
    ;;  (lambda (scene index)
    ;;    (jarvis-scenecutter--create-scene-async file scene index))
    ;;  scenes))
    )

  (defun jarvis-scenecutter--sentinel (proc event)
    (when (string= event "finished\n")
      (with-current-buffer (process-buffer proc)
	(let* ((data (gethash proc jarvis-scenecutter--scenes))
	       (file (plist-get data :file))
	       (scenes (plist-get data :scenes)))
	  (message "Finished extraction for %s" file)
	  (message "extracted %s scenes" (length scenes))
	  (jarvis-scenecutter--cache-scenes-save file data))
	  (jarvis-scenecutter--process-scenes file scenes)
	(remhash proc jarvis-scenecutter--scenes)
	(kill-current-buffer))))

  (defvar jarvis-scenecutter--scenes (make-hash-table))

  (defun jarvis-scenecutter--extract-scenes (file)
    (message "Started extraction for %s" file)
    (with-current-buffer (generate-new-buffer "*jarvis-scenecutter*")
      (let* ((pathname (expand-file-name file))
	     (cmd (list "ffmpeg" "-i" pathname "-vf" "select='gt(scene,0.4)',showinfo" "-f" "null" "-"))
	     (proc (make-process
		    :name pathname
		    :buffer (current-buffer)
		    :command cmd
		    :filter #'jarvis-scenecutter--parse-scenes
		    :sentinel #'jarvis-scenecutter--sentinel)))
	(puthash proc (list :file pathname :scenes '()) jarvis-scenecutter--scenes))))

  (defun jarvis-scenecutter (file)
    (interactive "fFile: ")
    (let ((data (jarvis-scenecutter--cache-scenes-load file)))
      (if data
	  (let ((file (plist-get data :file))
		(scenes (plist-get data :scenes)))
	    (jarvis-scenecutter--process-scenes file scenes))
	(jarvis-scenecutter--extract-scenes file))))
#+end_src
