emacs/modules.org
** Speak 🗣️

#+begin_src elisp
  (defun jarvis/espeak (text)
    "Speak text using `espeak`."
    (interactive "RText: ")
    (async-shell-command (format "espeak -v it \"%s\"" text) nil))
#+end_src

* AI - ChatGPT

Example of ChatGPT configuration using Gemini.

#+begin_src emacs-lisp :tangle no
  (use-package gptel
    :commands '(gptel gptel-send)
    :custom
    (gptel-model 'gemini-1.5-flash)
    (gptel-default-mode #'org-mode)
    :config
    (setq gptel-backend (gptel-make-gemini "Gemini"
  		   :key (gptel-api-key-from-auth-source "generativelanguage.googleapis.com")
  		   :stream t)))
#+end_src

* Bifrost 🌈                                                       :disabled:
*** Client side (userscript)

#+begin_src javascript :tangle no
  // ==UserScript==
  // @name         Bifrost-HTTP
  // @namespace    http://minasmazar.github.io/bifrost
  // @version      0.3
  // @description  Bifrost is a userscript to bridge your Browser and an Elixir app.
  // @author       minasmazar@gmail.com
  // @include      *
  // @icon         https://www.google.com/s2/favicons?sz=64&domain=undefined.localhost
  // @grant        GM_xmlhttpRequest
  // @grant        GM.xmlHttpRequest
  // @grant        GM_openInTab
  // @connect      localhost
  // ==/UserScript==

  window.bifrostCircularReplacer = function() {
    const seen = new WeakSet();
    return (key, value) => {
      if (typeof value === "object" && value !== null) {
	if (seen.has(value)) {
	  return;
	}
	seen.add(value);
      }
      return value;
    };
  };

  window.bifrostSend = function(message) {
    const payload = JSON.stringify({ "id": window.bifrostPageId, "location": window.location, "message": message }, window.bifrostCircularReplacer());
    console.log(`Sending : ${message}`);
    GM.xmlHttpRequest({
      method: "POST",
      url: "http://localhost:9096/bifrost",
      data: message,
      headers: {
	"Content-Type": "application/x-www-form-urlencoded"
      },
      onload: function(response) {
	console.log("Received response");
      },
      onerror: function(response) {
	console.log("Error");
      }
    });
  };

  window.bifrostOpenInTab = function(url, openInBackground = true) {
    //window.open(url, "_blank");
    GM_openInTab(url, openInBackground);
  };

  window.bifrostSetup = function() {
    window.bifrostPageId = crypto.randomUUID();
    window.bifrostEventHandler = function(event) {
      const payload = {
	"event": {
	  "type": event.type,
	  "tag": event.target.tagName,
	  "class": event.target.className,
	  "id": event.target.id,
	  "text": event.target.innerText,
	  "value": event.target.value
	}
      };
      // console.log(payload);
      window.bifrostSend(payload);
    };
    document.addEventListener("click", window.bifrostEventHandler);
    document.addEventListener("change", window.bifrostEventHandler);
    document.addEventListener("input", window.bifrostEventHandler);

    const links = [...document.querySelectorAll("a")].flatMap(el => el.href);
    window.bifrostSend({"links": links});
  };

  window.addEventListener("load", window.bifrostSetup);
#+end_src

*** Server side (emacs)
:PROPERTIES:
:header-args: :tangle (minemacs-tangle-if-not-disabled "bifrost.el") :mkdirp yes
:END:

#+begin_src emacs-lisp
  (use-package web-server
    :init
    (defcustom bifrost-active t "Wether bifrost is going to handle requests or not." :type '(boolean))
    (defvar bifrost-request-hooks nil "Hooks invoked when Bifrost request is received.")
    :hook
    (bifrost-request-hooks . (lambda (_request _dom)
			       (pop-to-buffer "*bifrost*")))
    :config
    (require 'web-server)

    (defun bifrost--request-handler (request)
      (when bifrost-active
	(with-current-buffer (get-buffer-create "*bifrost*" t)
	  (let ((inhibit-read-only t))
	    (erase-buffer)
	    (with-slots (body) request (insert body))
	    (beginning-of-buffer))
	  (setq bifrost--last-request request)
	  (let* ((json (json-parse-buffer))
		 (location (gethash "location" json))
		 (url (getash "href" location))
		 (message (gethash "message" json)))
	  (run-hook-with-args 'bifrost-request-hooks url message)))))

    (defun bifrost-server-start ()
      "Start bifrost server."
      (interactive)
      (setq bifrost--server
	    (ws-start
	     '(((:POST . ".*") .
		(lambda (request)
		  (with-slots (process headers body) request
		    (let ((message (cdr (assoc "message" headers))))
		      (ws-response-header process 200 '("Content-type" . "text/plain"))
		      (setq bifrost--last-request request)
		      (bifrost--request-handler request))))))
	     9096)))

    (when bifrost-active (bifrost-server-start)))
#+end_src

* Look and feel 🎨
:PROPERTIES:
:header-args: :tangle (minemacs-tangle-if-not-disabled "look_n_feel.el") :mkdirp yes
:END:
** Icons

#+begin_src elisp
  (use-package all-the-icons)
  (use-package all-the-icons-gnus
    :config
    (all-the-icons-gnus-setup))
  (use-package all-the-icons-dired
    :hook
    (dired-mode . all-the-icons-dired-mode))
  (use-package all-the-icons-ibuffer
    :hook
    (ibuffer-mode . all-the-icons-ibuffer-mode))
#+end_src

** Dashboard

#+begin_src elisp
  (use-package dashboard
    :config
    (dashboard-setup-startup-hook)
    :bind
    (:map dashboard-mode-map
  	("n" . #'widget-forward)
  	("p" . #'widget-backward))
    :custom
    (dashboard-week-agenda t)
    (dashboard-icon-type 'all-the-icons)
    (dashboard-set-file-icons t)
    (dashboard-set-heading-icons t)
    (dashboard-navigation-cycle t)
    (dashboard-items '((recents   . 5)
                       (bookmarks . 5)
                       (projects  . 5)
                       (agenda    . 5)
                       (registers . 5)))
    (dashboard-item-shortcuts '((recents   . "r")
                                (bookmarks . "m")
                                (projects  . "p")
                                (agenda    . "a")
                                (registers . "e"))))
#+end_src
** Beautify

#+begin_src elisp :tangle no
  (use-package org-modern
    :config
    (global-org-modern-mode))
#+end_src

** [[https://www.emacswiki.org/emacs/TransparentEmacs][Transparent Emacs]]

Remember you need a compositing manager to handle transparency (compton, compiz or else).

#+begin_src elisp
  (set-frame-parameter nil 'alpha-background 85)
#+end_src

** Highlight line                                                   :disabled:

#+begin_src elisp
  (use-package beacon
    :config
    (beacon-mode 1))
#+end_src

