emacs/modules.html
<div id="outline-container-org71493c9" class="outline-3">
<h3 id="org71493c9">Speak 🗣️</h3>
<div class="outline-text-3" id="text-org71493c9">
<div class="org-src-container">
<pre class="src src-elisp">(defun jarvis/espeak (text)
  "Speak text using `espeak`."
  (interactive "RText: ")
  (async-shell-command (format "espeak -v it \"%s\"" text) nil))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org46bfd0c" class="outline-2">
<h2 id="org46bfd0c">AI - ChatGPT</h2>
<div class="outline-text-2" id="text-org46bfd0c">
<p>
Example of ChatGPT configuration using Gemini.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package gptel
  :commands '(gptel gptel-send)
  :custom
  (gptel-model 'gemini-1.5-flash)
  (gptel-default-mode #'org-mode)
  :config
  (setq gptel-backend (gptel-make-gemini "Gemini"
                   :key (gptel-api-key-from-auth-source "generativelanguage.googleapis.com")
                   :stream t)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgad16946" class="outline-2">
<h2 id="orgad16946">Bifrost 🌈&#xa0;&#xa0;&#xa0;<span class="tag"><span class="disabled">disabled</span></span></h2>
<div class="outline-text-2" id="text-orgad16946">
</div>
<div id="outline-container-orgecc5375" class="outline-4">
<h4 id="orgecc5375">Client side (userscript)</h4>
<div class="outline-text-4" id="text-orgecc5375">
<div class="org-src-container">
<pre class="src src-javascript">// ==UserScript==
// @name         Bifrost-HTTP
// @namespace    http://minasmazar.github.io/bifrost
// @version      0.3
// @description  Bifrost is a userscript to bridge your Browser and an Elixir app.
// @author       minasmazar@gmail.com
// @include      *
// @icon         https://www.google.com/s2/favicons?sz=64&amp;domain=undefined.localhost
// @grant        GM_xmlhttpRequest
// @grant        GM.xmlHttpRequest
// @grant        GM_openInTab
// @connect      localhost
// ==/UserScript==

window.bifrostCircularReplacer = function() {
  const seen = new WeakSet();
  return (key, value) =&gt; {
    if (typeof value === "object" &amp;&amp; value !== null) {
        if (seen.has(value)) {
          return;
        }
        seen.add(value);
    }
    return value;
  };
};

window.bifrostSend = function(message) {
  const payload = JSON.stringify({ "id": window.bifrostPageId, "location": window.location, "message": message }, window.bifrostCircularReplacer());
  console.log(`Sending : ${message}`);
  GM.xmlHttpRequest({
    method: "POST",
    url: "http://localhost:9096/bifrost",
    data: message,
    headers: {
        "Content-Type": "application/x-www-form-urlencoded"
    },
    onload: function(response) {
        console.log("Received response");
    },
    onerror: function(response) {
        console.log("Error");
    }
  });
};

window.bifrostOpenInTab = function(url, openInBackground = true) {
  //window.open(url, "_blank");
  GM_openInTab(url, openInBackground);
};

window.bifrostSetup = function() {
  window.bifrostPageId = crypto.randomUUID();
  window.bifrostEventHandler = function(event) {
    const payload = {
        "event": {
          "type": event.type,
          "tag": event.target.tagName,
          "class": event.target.className,
          "id": event.target.id,
          "text": event.target.innerText,
          "value": event.target.value
        }
    };
    // console.log(payload);
    window.bifrostSend(payload);
  };
  document.addEventListener("click", window.bifrostEventHandler);
  document.addEventListener("change", window.bifrostEventHandler);
  document.addEventListener("input", window.bifrostEventHandler);

  const links = [...document.querySelectorAll("a")].flatMap(el =&gt; el.href);
  window.bifrostSend({"links": links});
};

window.addEventListener("load", window.bifrostSetup);
</pre>
</div>
</div>
</div>
<div id="outline-container-org582df21" class="outline-4">
<h4 id="org582df21">Server side (emacs)</h4>
<div class="outline-text-4" id="text-org582df21">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package web-server
  :init
  (defcustom bifrost-active t "Wether bifrost is going to handle requests or not." :type '(boolean))
  (defvar bifrost-request-hooks nil "Hooks invoked when Bifrost request is received.")
  :hook
  (bifrost-request-hooks . (lambda (_request _dom)
                               (pop-to-buffer "*bifrost*")))
  :config
  (require 'web-server)

  (defun bifrost--request-handler (request)
    (when bifrost-active
        (with-current-buffer (get-buffer-create "*bifrost*" t)
          (let ((inhibit-read-only t))
            (erase-buffer)
            (with-slots (body) request (insert body))
            (beginning-of-buffer))
          (setq bifrost--last-request request)
          (let* ((json (json-parse-buffer))
                 (location (gethash "location" json))
                 (url (getash "href" location))
                 (message (gethash "message" json)))
          (run-hook-with-args 'bifrost-request-hooks url message)))))

  (defun bifrost-server-start ()
    "Start bifrost server."
    (interactive)
    (setq bifrost--server
            (ws-start
             '(((:POST . ".*") .
                (lambda (request)
                  (with-slots (process headers body) request
                    (let ((message (cdr (assoc "message" headers))))
                      (ws-response-header process 200 '("Content-type" . "text/plain"))
                      (setq bifrost--last-request request)
                      (bifrost--request-handler request))))))
             9096)))

  (when bifrost-active (bifrost-server-start)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3d67031" class="outline-2">
<h2 id="org3d67031">Look and feel 🎨</h2>
<div class="outline-text-2" id="text-org3d67031">
</div>
<div id="outline-container-org4ecdae9" class="outline-3">
<h3 id="org4ecdae9">Icons</h3>
<div class="outline-text-3" id="text-org4ecdae9">
<div class="org-src-container">
<pre class="src src-elisp">(use-package all-the-icons)
(use-package all-the-icons-gnus
  :config
  (all-the-icons-gnus-setup))
(use-package all-the-icons-dired
  :hook
  (dired-mode . all-the-icons-dired-mode))
(use-package all-the-icons-ibuffer
  :hook
  (ibuffer-mode . all-the-icons-ibuffer-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2b81aee" class="outline-3">
<h3 id="org2b81aee">Dashboard</h3>
<div class="outline-text-3" id="text-org2b81aee">
<div class="org-src-container">
<pre class="src src-elisp">(use-package dashboard
  :config
  (dashboard-setup-startup-hook)
  :bind
  (:map dashboard-mode-map
        ("n" . #'widget-forward)
        ("p" . #'widget-backward))
  :custom
  (dashboard-week-agenda t)
  (dashboard-icon-type 'all-the-icons)
  (dashboard-set-file-icons t)
  (dashboard-set-heading-icons t)
  (dashboard-navigation-cycle t)
  (dashboard-items '((recents   . 5)
                     (bookmarks . 5)
                     (projects  . 5)
                     (agenda    . 5)
                     (registers . 5)))
  (dashboard-item-shortcuts '((recents   . "r")
                              (bookmarks . "m")
                              (projects  . "p")
                              (agenda    . "a")
                              (registers . "e"))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org59ea51a" class="outline-3">
<h3 id="org59ea51a">Beautify</h3>
<div class="outline-text-3" id="text-org59ea51a">
<div class="org-src-container">
<pre class="src src-elisp">(use-package org-modern
  :config
  (global-org-modern-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org30f2aae" class="outline-3">
<h3 id="org30f2aae"><a href="https://www.emacswiki.org/emacs/TransparentEmacs">Transparent Emacs</a></h3>
<div class="outline-text-3" id="text-org30f2aae">
<p>
Remember you need a compositing manager to handle transparency (compton, compiz or else).
</p>

<div class="org-src-container">
<pre class="src src-elisp">(set-frame-parameter nil 'alpha-background 85)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgba1f3cf" class="outline-3">
<h3 id="orgba1f3cf">Highlight line&#xa0;&#xa0;&#xa0;<span class="tag"><span class="disabled">disabled</span></span></h3>
<div class="outline-text-3" id="text-orgba1f3cf">
<div class="org-src-container">
<pre class="src src-elisp">(use-package beacon
  :config
  (beacon-mode 1))
</pre>
</div>
</div>
</div>
