emacs/modules.org
** Themes

- [[https://emacsthemes.com][Emacs Themes]]

#+begin_src elisp
  (use-package ef-themes
    :config
    (defun get-season (month)
      (cond
       ((and (>= month 3) (< month 6)) 'spring)
       ((and (>= month 6) (< month 9)) 'summer)
       ((and (>= month 10) (< month 12)) 'autumn)
       ((or (>= month 12) (< month 3)) 'winter)))

    (defun set-season-theme ()
      (interactive)
      (let* ((month (car (calendar-current-date)))
  	   (season (get-season month))
  	   (theme-name (format "ef-%s" season)))
        (load-theme (intern theme-name)))))
#+end_src

** Modeline

Install the =doom-modeline=.

#+begin_src elisp
  (use-package doom-modeline
    :hook (after-init . doom-modeline-mode))
#+end_src

#+end_src
** Headline

#+begin_src elisp
  (defcustom minemacs-headline-content ""
    "Content of the headline."
    :type 'string)
  (setq header-line-format '((:eval minemacs-headline-content)))
#+end_src

* Networking
** Search

#+begin_src elisp
  (use-package engine-mode
    :init
    (setq engine/browser-function #'browse-url-firefox)
    :config
    (defun engine/execute-search (search-engine-url browser-function search-term)
      "Display the results of the query."
      (interactive)
      (let ((browse-url-handlers nil)
  	    (browse-url-browser-function browser-function))
  	(browse-url
  	 (format-spec search-engine-url
  		      (format-spec-make ?s (url-hexify-string search-term))))))

    (defengine dropbox
      "https://www.dropbox.com/search/personal?query=%s"
      :browser 'browse-url-firefox
      :keybinding "D")

    (defengine duckduckgo
      "https://duckduckgo.com/?q=%s"
      :browser 'eww-browse-url
      :keybinding "d")

    (defengine github
      "https://github.com/search?ref=simplesearch&q=%s"
      :keybinding "h")

    (defengine google
      "http://www.google.com/search?ie=utf-8&oe=utf-8&q=%s"
      :browser 'browse-url-firefox
      :keybinding "g")

    (defengine google-images
      "http://www.google.com/images?hl=en&source=hp&biw=1440&bih=795&gbv=2&aq=f&aqi=&aql=&oq=&q=%s"
      :keybinding "i")

    (defengine google-maps
      "https://maps.google.com/maps?q=%s"
      :docstring "Google Maps"
      :browser 'browse-url-firefox
      :keybinding "m")

    (defengine openstreet-maps
      "https://www.openstreetmap.org/search?query=%s"
      :docstring "OpenStreetMap"
      :keybinding "M")

    (defengine google-translate-to-it
      "http://translate.google.it/?sl=auto&tl=it&text=%s&op=translate"
      :docstring "Translate to IT"
      :keybinding "t")

    (defengine google-translate-to-en
      "http://translate.google.it/?sl=it&tl=en&text=%s&op=translate"
      :docstring "Translate from IT to English"
      :browser 'browse-url-firefox
      :keybinding "T")

    (defengine stack-overflow
      "https://stackoverflow.com/search?q=%s"
      :keybinding "s")

    (defengine wikipedia
      "https://www.wikipedia.org/search-redirect.php?language=it&go=Go&search=%s"
      :keybinding "w"
      :docstring "Searchin' the wikis."
      :browser 'eww-browse-url)

    (defengine youtube
      "http://www.youtube.com/results?aq=f&oq=&search_query=%s"
      :keybinding "y")

    (defengine amazon
      "https://www.amazon.it/s/ref=nb_sb_noss?&field-keywords=%s"
      :browser 'browse-url-firefox
      :keybinding "a")

    (defengine cap
      "https://www.nonsolocap.it/cap?k=%s&c=pescara"
      :browser 'browse-url-firefox
      :keybinding "C")

    (engine-mode t))
#+end_src

** Browse Url

Add a specific =browse-url= function which open firefox in private mode.

#+begin_src emacs-lisp
  (defun browse-url-firefox-private (url)
    "Ask the Firefox WWW browser to load URL.
Same as `browse-url-firefox', but sets `browse-url-firefox-arguments'."
    (interactive "sURL: ")
    (let ((browse-url-firefox-arguments (list "--private-window")))
      (funcall-interactively #'browse-url-firefox url)))
#+end_src

** Gopher and Gemini

#+begin_src emacs-lisp
  (use-package elpher)
  (use-package gemini-mode)
#+end_src

** HTTP Client

#+begin_src emacs-lisp
  (use-package walkman)
  (use-package restclient)
#+end_src

* Multimedia 🎶
:PROPERTIES:
:header-args: :tangle (minemacs-tangle-if-not-disabled "media.el") :mkdirp yes
:END:

** Bongo

The **MPV** backend by default is able to play "http" URIs, but when you add a "https:" one (i.e. copy paste a youtube video URL), bongo replys with =bongo-play-file: Don’t know how to play https://www.youtube.com/watch?......=. In order to allow =mpv= to play "https" URIs change the =bongo-custom-backend-matchers= variable.

#+begin_src elisp
  (use-package bongo
    :custom
    (bongo-custom-backend-matchers '((mpv ("https:") . t)))
    :bind
    (:map dired-mode-map
  	  ("b a" . #'bongo-dired-append-enqueue-lines)))
#+end_src

** Youtube

#+begin_src elisp
  (use-package yeetube
    :bind
    (:map minemacs-map
  	("m y s" . #'yeetube-search)
  	("m y es" . #'empv-youtube)))

  (use-package ytdl
    :bind
    (:map minemacs-map ("m y d" . #'ytdl-download)))
#+end_src

** Pulseaudio interface

#+begin_src elisp
    (use-package pulseaudio-control
      :after hydra
      :defer t
      :config
      (defhydra hydra-pulseaudio-control (:color amaranth)
	"
  Control audio (pulseaudio)
  🔊 [n] decrease | 🔉 [_p_] decrease | 🔇 _m_ute == _q_uit
  "
	("p" (lambda () (interactive) (pulseaudio-control-increase-sink-volume 5)) nil)
	("n" (lambda () (interactive) (pulseaudio-control-decrease-sink-volume 5)) nil)
	("m" (lambda () (interactive) (pulseaudio-control-toggle-current-sink-mute)) nil)		       
	("q" nil nil))
      :bind
      (:map minemacs-map (("m v" . hydra-pulseaudio-control/body))))
#+end_src

* News 📰 and Mail 📬
:PROPERTIES:
:header-args: :tangle (minemacs-tangle-if-not-disabled "news-mail.el") :mkdirp yes
:END:
