emacs/modules.html
<div id="outline-container-orgd06b746" class="outline-3">
<h3 id="orgd06b746">Themes</h3>
<div class="outline-text-3" id="text-orgd06b746">
<ul class="org-ul">
<li><a href="https://emacsthemes.com">Emacs Themes</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp">(use-package ef-themes
  :config
  (defun get-season (month)
    (cond
     ((and (&gt;= month 3) (&lt; month 6)) 'spring)
     ((and (&gt;= month 6) (&lt; month 9)) 'summer)
     ((and (&gt;= month 10) (&lt; month 12)) 'autumn)
     ((or (&gt;= month 12) (&lt; month 3)) 'winter)))

  (defun set-season-theme ()
    (interactive)
    (let* ((month (car (calendar-current-date)))
           (season (get-season month))
           (theme-name (format "ef-%s" season)))
      (load-theme (intern theme-name)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org4306551" class="outline-3">
<h3 id="org4306551">Modeline</h3>
<div class="outline-text-3" id="text-org4306551">
<p>
Install the <code>doom-modeline</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(use-package doom-modeline
  :hook (after-init . doom-modeline-mode))
</pre>
</div>

<p>
#+end<sub>src</sub>
</p>
</div>
</div>
<div id="outline-container-orgcf8804f" class="outline-3">
<h3 id="orgcf8804f">Headline</h3>
<div class="outline-text-3" id="text-orgcf8804f">
<div class="org-src-container">
<pre class="src src-elisp">(defcustom minemacs-headline-content ""
  "Content of the headline."
  :type 'string)
(setq header-line-format '((:eval minemacs-headline-content)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org03f04e4" class="outline-2">
<h2 id="org03f04e4">Networking</h2>
<div class="outline-text-2" id="text-org03f04e4">
</div>
<div id="outline-container-orgfa932ac" class="outline-3">
<h3 id="orgfa932ac">Search</h3>
<div class="outline-text-3" id="text-orgfa932ac">
<div class="org-src-container">
<pre class="src src-elisp">(use-package engine-mode
  :init
  (setq engine/browser-function #'browse-url-firefox)
  :config
  (defun engine/execute-search (search-engine-url browser-function search-term)
    "Display the results of the query."
    (interactive)
    (let ((browse-url-handlers nil)
            (browse-url-browser-function browser-function))
        (browse-url
         (format-spec search-engine-url
                      (format-spec-make ?s (url-hexify-string search-term))))))

  (defengine dropbox
    "https://www.dropbox.com/search/personal?query=%s"
    :browser 'browse-url-firefox
    :keybinding "D")

  (defengine duckduckgo
    "https://duckduckgo.com/?q=%s"
    :browser 'eww-browse-url
    :keybinding "d")

  (defengine github
    "https://github.com/search?ref=simplesearch&amp;q=%s"
    :keybinding "h")

  (defengine google
    "http://www.google.com/search?ie=utf-8&amp;oe=utf-8&amp;q=%s"
    :browser 'browse-url-firefox
    :keybinding "g")

  (defengine google-images
    "http://www.google.com/images?hl=en&amp;source=hp&amp;biw=1440&amp;bih=795&amp;gbv=2&amp;aq=f&amp;aqi=&amp;aql=&amp;oq=&amp;q=%s"
    :keybinding "i")

  (defengine google-maps
    "https://maps.google.com/maps?q=%s"
    :docstring "Google Maps"
    :browser 'browse-url-firefox
    :keybinding "m")

  (defengine openstreet-maps
    "https://www.openstreetmap.org/search?query=%s"
    :docstring "OpenStreetMap"
    :keybinding "M")

  (defengine google-translate-to-it
    "http://translate.google.it/?sl=auto&amp;tl=it&amp;text=%s&amp;op=translate"
    :docstring "Translate to IT"
    :keybinding "t")

  (defengine google-translate-to-en
    "http://translate.google.it/?sl=it&amp;tl=en&amp;text=%s&amp;op=translate"
    :docstring "Translate from IT to English"
    :browser 'browse-url-firefox
    :keybinding "T")

  (defengine stack-overflow
    "https://stackoverflow.com/search?q=%s"
    :keybinding "s")

  (defengine wikipedia
    "https://www.wikipedia.org/search-redirect.php?language=it&amp;go=Go&amp;search=%s"
    :keybinding "w"
    :docstring "Searchin' the wikis."
    :browser 'eww-browse-url)

  (defengine youtube
    "http://www.youtube.com/results?aq=f&amp;oq=&amp;search_query=%s"
    :keybinding "y")

  (defengine amazon
    "https://www.amazon.it/s/ref=nb_sb_noss?&amp;field-keywords=%s"
    :browser 'browse-url-firefox
    :keybinding "a")

  (defengine cap
    "https://www.nonsolocap.it/cap?k=%s&amp;c=pescara"
    :browser 'browse-url-firefox
    :keybinding "C")

  (engine-mode t))
</pre>
</div>
</div>
</div>
<div id="outline-container-org33896e6" class="outline-3">
<h3 id="org33896e6">Browse Url</h3>
<div class="outline-text-3" id="text-org33896e6">
<p>
Add a specific <code>browse-url</code> function which open firefox in private mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  (defun browse-url-firefox-private (url)
    "Ask the Firefox WWW browser to load URL.
Same as `browse-url-firefox', but sets `browse-url-firefox-arguments'."
    (interactive "sURL: ")
    (let ((browse-url-firefox-arguments (list "--private-window")))
      (funcall-interactively #'browse-url-firefox url)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2301c4e" class="outline-3">
<h3 id="org2301c4e">Gopher and Gemini</h3>
<div class="outline-text-3" id="text-org2301c4e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package elpher)
(use-package gemini-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9d9d45d" class="outline-3">
<h3 id="org9d9d45d">HTTP Client</h3>
<div class="outline-text-3" id="text-org9d9d45d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package walkman)
(use-package restclient)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdb56e4f" class="outline-2">
<h2 id="orgdb56e4f">Multimedia 🎶</h2>
<div class="outline-text-2" id="text-orgdb56e4f">
</div>
<div id="outline-container-org2fafc97" class="outline-3">
<h3 id="org2fafc97">Bongo</h3>
<div class="outline-text-3" id="text-org2fafc97">
<p>
The <b><b>MPV</b></b> backend by default is able to play "http" URIs, but when you add a "https:" one (i.e. copy paste a youtube video URL), bongo replys with <code>bongo-play-file: Don’t know how to play https://www.youtube.com/watch?......</code>. In order to allow <code>mpv</code> to play "https" URIs change the <code>bongo-custom-backend-matchers</code> variable.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(use-package bongo
  :custom
  (bongo-custom-backend-matchers '((mpv ("https:") . t)))
  :bind
  (:map dired-mode-map
          ("b a" . #'bongo-dired-append-enqueue-lines)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2fe0b62" class="outline-3">
<h3 id="org2fe0b62">Youtube</h3>
<div class="outline-text-3" id="text-org2fe0b62">
<div class="org-src-container">
<pre class="src src-elisp">(use-package yeetube
  :bind
  (:map minemacs-map
        ("m y s" . #'yeetube-search)
        ("m y es" . #'empv-youtube)))

(use-package ytdl
  :bind
  (:map minemacs-map ("m y d" . #'ytdl-download)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org0b58cfe" class="outline-3">
<h3 id="org0b58cfe">Pulseaudio interface</h3>
<div class="outline-text-3" id="text-org0b58cfe">
<div class="org-src-container">
<pre class="src src-elisp">  (use-package pulseaudio-control
    :after hydra
    :defer t
    :config
    (defhydra hydra-pulseaudio-control (:color amaranth)
        "
Control audio (pulseaudio)
🔊 [n] decrease | 🔉 [_p_] decrease | 🔇 _m_ute == _q_uit
"
        ("p" (lambda () (interactive) (pulseaudio-control-increase-sink-volume 5)) nil)
        ("n" (lambda () (interactive) (pulseaudio-control-decrease-sink-volume 5)) nil)
        ("m" (lambda () (interactive) (pulseaudio-control-toggle-current-sink-mute)) nil)		       
        ("q" nil nil))
    :bind
    (:map minemacs-map (("m v" . hydra-pulseaudio-control/body))))
</pre>
</div>
</div>
</div>
</div>
