emacs/modules.html
<div id="outline-container-orgad20350" class="outline-2">
<h2 id="orgad20350">News 📰 and Mail 📬</h2>
<div class="outline-text-2" id="text-orgad20350">
</div>
<div id="outline-container-orge89c95e" class="outline-3">
<h3 id="orge89c95e">RSS</h3>
<div class="outline-text-3" id="text-orge89c95e">
<div class="org-src-container">
<pre class="src src-elisp">(use-package elfeed
  :after 'god-mode
  :bind*
  (:map elfeed-search-mode-map ("U" . (lambda () (interactive) (run-at-time "10min" t #'elfeed-update))))
  :init
  (add-to-list 'god-exempt-major-modes 'elfeed-search-mode-map)
  (add-to-list 'god-exempt-major-modes 'elfeed-show-mode-map))
</pre>
</div>

<p>
Enanche your elfeed experience with <a href="https://github.com/karthink/elfeed-tube">elfeed-tube</a>! ❤️ Thanks a lot to <a href="https://github.com/karthink">karthink</a> 🙏
</p>

<div class="org-src-container">
<pre class="src src-elisp">(use-package elfeed-tube
  :after elfeed
  :demand t
  :config
  ;; (setq elfeed-tube-auto-save-p nil) ; default value
  ;; (setq elfeed-tube-auto-fetch-p t)  ; default value
  (elfeed-tube-setup)

  :bind (:map elfeed-show-mode-map
                ("F" . #'elfeed-tube-fetch)
                ([remap save-buffer] . elfeed-tube-save)
                :map elfeed-search-mode-map
                ("F" . elfeed-tube-fetch)
                ([remap save-buffer] . elfeed-tube-save)))

(use-package elfeed-tube-mpv
  :after elfeed-tube
  :bind (:map elfeed-show-mode-map
                ("v" . #'elfeed-tube-mpv)
                ("C-c C-f" . elfeed-tube-mpv-follow-mode)
                ("C-c C-w" . elfeed-tube-mpv-where)))

(use-package elfeed-org)
</pre>
</div>

<p>
Here's an experiment on how to iterate over the elfeed feeds
</p>

<div class="org-src-container">
<pre class="src src-elisp">(let* ((feeds nil))
  (with-elfeed-db-visit (entry feed)
    (add-to-list 'feeds feed)
    (when (equal (length feeds) 1)
        (elfeed-db-return (list :ok feeds)))))
</pre>
</div>

<p>
Here's a snippet on how to export the list of the URLs for all the feeds in <code>elfeed-feeds</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(dolist (feed elfeed-feeds)
  (let ((url (cond ((listp feed) (car feed))
                     ((stringp feed) feed))))
    (insert url)
    (newline)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8ce32f2" class="outline-3">
<h3 id="org8ce32f2">Mail</h3>
<div class="outline-text-3" id="text-org8ce32f2">
</div>
<div id="outline-container-orgeb1df01" class="outline-4">
<h4 id="orgeb1df01">Resources</h4>
<div class="outline-text-4" id="text-orgeb1df01">
<ul class="org-ul">
<li><a href="https://f-santos.gitlab.io/2020-04-24-mu4e.html">https://f-santos.gitlab.io/2020-04-24-mu4e.html</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbe871a5" class="outline-4">
<h4 id="orgbe871a5">Mu4e</h4>
<div class="outline-text-4" id="text-orgbe871a5">
</div>
<ul class="org-ul">
<li><a id="orgc9820fd"></a>Dependencies<br />
<div class="outline-text-5" id="text-orgc9820fd">
<p>
Firstly, install <code>mu</code> and a MailBox &lt;-&gt; Imaps syncronizer like <code>mbsync</code>. You should also rely on <code>pass</code>, the <a href="https://www.passwordstore.org/">the standard unix password manager</a>, in order to store and fetch your passwords in a secure way.
</p>

<p>
On <i>deb based linux systems</i> you can install those via
</p>

<pre class="example" id="org1b15120">
$ sudo apt install mu isync pass
</pre>

<p>
Useful links:
</p>
<ul class="org-ul">
<li><a href="http://frostyx.cz/posts/synchronize-your-2fa-gmail-with-mbsync">http://frostyx.cz/posts/synchronize-your-2fa-gmail-with-mbsync</a></li>
<li><a href="https://www.djcbsoftware.nl/code/mu/mu4e/Gmail-configuration.html">https://www.djcbsoftware.nl/code/mu/mu4e/Gmail-configuration.html</a></li>
<li><a href="https://isync.sourceforge.io/mbsync.html">https://isync.sourceforge.io/mbsync.html</a></li>
</ul>
</div>
</li>
<li><a id="orge00e010"></a>Mail Account info<br />
<div class="outline-text-5" id="text-orge00e010">
<p>
Create a file <code>~/.authinfo</code> directly in the root of your home directory.
</p>

<pre class="example" id="org048e360">
machine smtp.example.com login myname port 587 password mypassword
</pre>
</div>
</li>
<li><a id="orgfeaeb6c"></a>mbsync configuration<br />
<div class="outline-text-5" id="text-orgfeaeb6c">
<p>
Configure <code>mbsync</code> via <code>~/.mbsyncrc</code> with a content similar to this:
</p>

<pre class="example" id="org55f3e4e">
IMAPAccount gmail-imaps
Host imap.gmail.com
Port 993
#UseIMAPS yes
#RequireSSl yes
SSLType IMAPS
SSLVersions TLSv1.2
AuthMechs PLAIN
User your-email@gmail.com
#Pass supercomplicatedpassword
PassCmd "pass gmail/imaps"

IMAPStore gmail-remote
Account gmail-imaps

MaildirStore gmail-local
Path ~/MailDir/gmail/
Inbox ~/MailDir/gmail/INBOX
Subfolders Verbatim

Channel gmail
#Master :gmail-remote:
#Slave :gmail-local:
Far :gmail-remote:
Near :gmail-local:
Create Both
Expunge Both
Patterns *
SyncState *
</pre>
</div>
</li>
<li><a id="org5ba8aa2"></a>mu4e configuration<br />
<div class="outline-text-5" id="text-org5ba8aa2">
<pre class="example" id="org71b69b1">
(require 'mu4e)
(setq send-mail-function 'smtpmail-send-it
	message-send-mail-function 'smtpmail-send-it
	mu4e-get-mail-command "mbsync -a"
	;;mu4e-maildir "~/Mail"
	mu4e-update-interval (* 60 10)
	smtpmail-default-smtp-server "smtp.gmail.com"
	smtpmail-smtp-server "smtp.gmail.com"
	;;smtpmail-stream-type 'ssl
	;;smtpmail-smtp-service 465
	smtpmail-stream-type 'starttls
	smtpmail-smtp-service 587
	;;smtpmail-use-gnutls t
	mu4e-drafts-folder "/[Gmail].Drafts"
	mu4e-sent-folder   "/[Gmail].Sent Mail"
	mu4e-trash-folder  "/[Gmail].Trash"
	mm-discouraged-alternatives '("text/html")
	mml-secure-openpgp-signers '("XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX"))
(add-hook 'message-send-hook 'mml-secure-message-sign-pgpmime)
(auth-source-pass-enable)
(setq smtpmail-debug-info t)
</pre>

<p>
To set multiple accounts within <code>mu4e</code> you have to set the <code>mu4e-contexts</code> variable. An interesting screencast/article from System Crafters about that can be found <a href="https://systemcrafters.net/emacs-mail/managing-multiple-accounts/">here</a>.
</p>

<pre class="example" id="org0f95267">
(setq mu4e-contexts
	(list
	 ;; Work account
	 (make-mu4e-context
	  :name "GMail"
	  :match-func
	  (lambda (msg)
	    (when msg
	      (string-prefix-p "/Gmail" (mu4e-message-field msg :maildir))))
	  :vars '((user-mail-address . "my-email@gmail.com")
		  (user-full-name    . "My-Email (Gmail)")
		  (mu4e-drafts-folder  . "/Gmail/[Gmail]/Drafts")
		  (mu4e-sent-folder  . "/Gmail/[Gmail]/Sent Mail")
		  (mu4e-refile-folder  . "/Gmail/[Gmail]/All Mail")
		  (mu4e-trash-folder  . "/Gmail/[Gmail]/Trash")))

	 ;; Personal account
	 (make-mu4e-context
	  :name "Yahoo"
	  :match-func
	  (lambda (msg)
	    (when msg
	      (string-prefix-p "/Yahoo" (mu4e-message-field msg :maildir))))
	  :vars '((user-mail-address . "my-email@yahoo.com")
		  (user-full-name    . "My-Email (Yahoo)")
		  (mu4e-drafts-folder  . "/Yahoo/Drafts")
		  (mu4e-sent-folder  . "/Yahoo/Sent")
		  (mu4e-refile-folder  . "/Yahoo/Archive")
		  (mu4e-trash-folder  . "/Yahoo/Trash")))))
</pre>
</div>
</li>
<li><a id="org69ddfb5"></a>Tweaking &amp; Troubleshooting<br />
<div class="outline-text-5" id="text-org69ddfb5">
<p>
Mu4e does not allow to save all attachments in one shot (some workarounds to achieve that involve completion frameworks like <code>Ivy</code> or use <code>Embark</code> to select all attachments from the minibuffer after invoking <code>mu4e-view-save-attachment</code>). For more details see <a href="https://github.com/djcb/mu/issues/1979">this issue on Github</a>.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgd413de8" class="outline-4">
<h4 id="orgd413de8">Gnus</h4>
<div class="outline-text-4" id="text-orgd413de8">
<p>
To configure gnus in order to read your Gmail, you have to:
</p>

<ul class="org-ul">
<li>create a password token on the Gmail account</li>
<li>enter an authentication line in your <code>authinfo</code></li>
</ul>

<p>
Then configure the <code>gnus-select-method</code>
</p>

<pre class="example" id="org5e52a2a">
(setq gnus-select-method
	'(nnimap "gmail"
		 (nnimap-address "imap.gmail.com")
		 (nnimap-server-port "imaps")
		 (nnimap-stream ssl)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb77f04b" class="outline-2">
<h2 id="orgb77f04b">Utils ⚒️</h2>
<div class="outline-text-2" id="text-orgb77f04b">
</div>
<div id="outline-container-orgdf113ce" class="outline-3">
<h3 id="orgdf113ce">Password management</h3>
<div class="outline-text-3" id="text-orgdf113ce">
<p>
To retrieve passwords use <code>(password-store-get "youtube-api")</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(use-package password-store)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf98e3a2" class="outline-3">
<h3 id="orgf98e3a2">Alarms and clock</h3>
<div class="outline-text-3" id="text-orgf98e3a2">
<div class="org-src-container">
<pre class="src src-elisp">(use-package alarm-clock)
</pre>
</div>
</div>
</div>
</div>
