emacs/modules.org
* File server                                                      :disabled:
:PROPERTIES:
:header-args: :tangle (minemacs-tangle-if-not-disabled "file-server.el") :mkdirp yes
:END:

Uses [[https://eschulte.github.io/emacs-web-server/][=emacs-web-server= package]]. Here's an /helloworld/ example, taken from the [[https://eschulte.github.io/emacs-web-server/tutorials/][online tutorial]].

#+begin_src emacs-lisp :tangle no
  (ws-start
   (lambda (request)
     (with-slots (process headers) request
       (ws-response-header process 200 '("Content-type" . "text/plain"))
       (process-send-string process "hello world")))
   9000)
#+end_src

In order to make the endpoint available in a local net (i.e =192.168.xxx.xxx=) we have to override the function =ws-start= in =web-server.el= by adding the =:host= parameter when calling =make-network-process=:

#+begin_src diff :tangle no
  (setf (ws-process server)
        (apply
         #'make-network-process
         :name "ws-server"
         :service (ws-port server)
         :filter 'ws-filter
         :server t
         :nowait (< emacs-major-version 26)
         :family 'ipv4
  +      :host "0.0.0.0"
         :coding 'no-conversion
#+end_src

Here's the implementation of a simple web server, serving static assets.

#+begin_src emacs-lisp
  (use-package web-server
    ;; :vc (:url "https://github.com/eschulte/emacs-web-server.git")
    :init
    (defcustom minemacs-ws-enabled nil "When non-nil start the file server at Emacs startup." :type '(boolean))
    (defcustom minemacs-ws-docroot "~/Public" "Root directory to be served within the File Server" :type '(directory))
    :config
    (defun minemacs-file-server-start ()
      (interactive)
      (ws-start
       (lambda (request)
         (with-slots (process headers) request
  	 (let ((docroot (expand-file-name minemacs-ws-docroot))
  	       (path (url-unhex-string (substring (cdr (assoc :GET headers)) 1))))
  	   (if (ws-in-directory-p docroot path)
  	       (if (file-directory-p (expand-file-name path docroot))
  		   (ws-send-directory-list process
  					   (expand-file-name path docroot) "^[^\.]")
  		 (ws-send-file process (expand-file-name path docroot)))
  	     (ws-send-404 process)))))
       3000))
    (when minemacs-ws-enabled (minemacs-file-server-start)))
#+end_src

* Emacs and Desktop
