emacs/modules.html
<div id="outline-container-orga392ea1" class="outline-2">
<h2 id="orga392ea1">File server&#xa0;&#xa0;&#xa0;<span class="tag"><span class="disabled">disabled</span></span></h2>
<div class="outline-text-2" id="text-orga392ea1">
<p>
Uses <a href="https://eschulte.github.io/emacs-web-server/"><code>emacs-web-server</code> package</a>. Here's an <i>helloworld</i> example, taken from the <a href="https://eschulte.github.io/emacs-web-server/tutorials/">online tutorial</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(ws-start
 (lambda (request)
   (with-slots (process headers) request
     (ws-response-header process 200 '("Content-type" . "text/plain"))
     (process-send-string process "hello world")))
 9000)
</pre>
</div>

<p>
In order to make the endpoint available in a local net (i.e <code>192.168.xxx.xxx</code>) we have to override the function <code>ws-start</code> in <code>web-server.el</code> by adding the <code>:host</code> parameter when calling <code>make-network-process</code>:
</p>

<div class="org-src-container">
<pre class="src src-diff">(setf (ws-process server)
      (apply
       #'make-network-process
       :name "ws-server"
       :service (ws-port server)
       :filter 'ws-filter
       :server t
       :nowait (&lt; emacs-major-version 26)
       :family 'ipv4
+      :host "0.0.0.0"
       :coding 'no-conversion
</pre>
</div>

<p>
Here's the implementation of a simple web server, serving static assets.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package web-server
  ;; :vc (:url "https://github.com/eschulte/emacs-web-server.git")
  :init
  (defcustom minemacs-ws-enabled nil "When non-nil start the file server at Emacs startup." :type '(boolean))
  (defcustom minemacs-ws-docroot "~/Public" "Root directory to be served within the File Server" :type '(directory))
  :config
  (defun minemacs-file-server-start ()
    (interactive)
    (ws-start
     (lambda (request)
       (with-slots (process headers) request
         (let ((docroot (expand-file-name minemacs-ws-docroot))
               (path (url-unhex-string (substring (cdr (assoc :GET headers)) 1))))
           (if (ws-in-directory-p docroot path)
               (if (file-directory-p (expand-file-name path docroot))
                   (ws-send-directory-list process
                                           (expand-file-name path docroot) "^[^\.]")
                 (ws-send-file process (expand-file-name path docroot)))
             (ws-send-404 process)))))
     3000))
  (when minemacs-ws-enabled (minemacs-file-server-start)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6a401dc" class="outline-2">
<h2 id="org6a401dc">Emacs and Desktop</h2>
<div class="outline-text-2" id="text-org6a401dc">
</div>
