emacs/modules.html
<div id="outline-container-orgef5faa0" class="outline-3">
<h3 id="orgef5faa0">i3wm</h3>
<div class="outline-text-3" id="text-orgef5faa0">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package i3wm-config-mode)
(use-package i3wm)
</pre>
</div>

<p>
A fine tuned i3 configuration file that fits well with an <i>Emacs-centric</i> user experience: in order to access WM specific commands (split directions, window tiling mode, etc) hit <code>$mod+Return</code> to access the <b><b>i3</b></b> mode, and <code>alt+Tab</code> to cycle across windows; all other keybidings will go straight to Emacs.
</p>

<div class="org-src-container">
<pre class="src src-i3wm-config"># This file has been auto-generated by i3-config-wizard(1).
# It will not be overwritten, so edit it as you like.
#
# Should you change your keyboard layout some time, delete
# this file and re-run i3-config-wizard(1).
#

# i3 config file (v4)
#
# Please see https://i3wm.org/docs/userguide.html for a complete reference!

set $mod Mod4
set $alt Mod1
set $wallpaper_file ~/Pictures/wallpaper

# Font for window titles. Will also be used by the bar unless a different font
# is used in the bar {} block below.
font pango:monospace 8

# This font is widely installed, provides lots of unicode glyphs, right-to-left
# text rendering and scalability on retina/hidpi displays (thanks to pango).
#font pango:DejaVu Sans Mono 8

# Start XDG autostart .desktop files using dex. See also
# https://wiki.archlinux.org/index.php/XDG_Autostart
exec --no-startup-id dex --autostart --environment i3
exec --no-startup-id xfsettingsd
exec --no-startup-id compton
exec --no-startup-id nitrogen --restore
# exec --no-startup-id xmodmap ~/.Xmodmaprc

# The combination of xss-lock, nm-applet and pactl is a popular choice, so
# they are included here as an example. Modify as you see fit.

# xss-lock grabs a logind suspend inhibit lock and will use i3lock to lock the
# screen before suspend. Use loginctl lock-session to lock your screen.
# exec --no-startup-id xss-lock --transfer-sleep-lock -- i3lock --nofork
exec --no-startup-id xss-lock --transfer-sleep-lock -- light-locker --nofork

# NetworkManager is the most popular way to manage wireless networks on Linux,
# and nm-applet is a desktop environment-independent system tray GUI for it.
exec --no-startup-id nm-applet

# Autostart Emacs
# exec --no-startup-id emacs --daemon # not needed since it has been started as a service via systemd
exec --no-startup-id sleep 10 &amp;&amp; emacsclient -r

# Use pactl to adjust volume in PulseAudio.
set $volume_step 5%
set $refresh_i3status killall -SIGUSR1 i3status
bindsym XF86AudioRaiseVolume exec --no-startup-id pactl set-sink-volume @DEFAULT_SINK@ +$volume_step &amp;&amp; $refresh_i3status
bindsym XF86AudioLowerVolume exec --no-startup-id pactl set-sink-volume @DEFAULT_SINK@ -$volume_step &amp;&amp; $refresh_i3status
bindsym XF86AudioMute exec --no-startup-id pactl set-sink-mute @DEFAULT_SINK@ toggle &amp;&amp; $refresh_i3status
bindsym XF86AudioMicMute exec --no-startup-id pactl set-source-mute @DEFAULT_SOURCE@ toggle &amp;&amp; $refresh_i3status

# Use Mouse+$mod to drag floating windows to their wanted position
floating_modifier $mod

# move tiling windows via drag &amp; drop by left-clicking into the title bar,
# or left-clicking anywhere into the window while holding the floating modifier.
tiling_drag modifier titlebar

# start applications via dmenu_run or i3-dmenu-desktop or xfce4-appfinder
set $app_launcher i3-dmenu-desktop
set $terminal_app i3-sensible-terminal
set $take_screenshot import -window root ~/Desktop/screenshot.png
bindsym $mod+space exec --no-startup-id $app_launcher ; mode "default"
bindsym $mod+Shift+space exec --no-startup-id $terminal_app
# Emacs everywhere
bindsym $mod+Shift+e exec --no-startup-id emacsclient --eval "(emacs-everywhere)"

# kill focused window
bindsym $mod+Shift+q kill

# change focus
bindsym $mod+Tab focus left ; focus up
bindsym $mod+Shift+Tab focus right ; focus down

# Define names for default workspaces for which we configure key bindings later on.
# We use variables to avoid repeating the names in multiple places.

set $ws1 "1:emacs"
set $ws2 "2:www"
set $ws3 "3:media"
set $ws4 "4:apps"
set $ws5 "5:term"

bindcode $mod+Shift+34 workspace prev
bindcode $mod+Shift+35 workspace next
bindsym $mod+1 workspace $ws1
bindsym $mod+2 workspace $ws2
bindsym $mod+3 workspace $ws3
bindsym $mod+4 workspace $ws4
bindsym $mod+5 workspace $ws5
bindsym $mod+Shift+1 move container to workspace $ws1
bindsym $mod+Shift+2 move container to workspace $ws2
bindsym $mod+Shift+3 move container to workspace $ws3
bindsym $mod+Shift+4 move container to workspace $ws4
bindsym $mod+Shift+5 move container to workspace $ws5

# Window rules
assign [class="^mpv$"] $ws3
assign [class="^firefox$"] $ws2
assign [class="^Emacs$"] $ws1

mode "i3" {
  # start program launcher
  bindsym d exec --no-startup-id $app_launcher ; mode "default"

  # alternatively, you can use the cursor keys:
  bindsym Left focus left
  bindsym Down focus down
  bindsym Up focus up
  bindsym Right focus right

  bindsym Shift+Left move left
  bindsym Shift+Down move down
  bindsym Shift+Up move up
  bindsym Shift+Right move right

  # toggle i3bar mode
  bindsym i bar mode toggle ; mode "default"

  # split in horizontal orientation
  bindsym h split h

  # split in vertical orientation
  bindsym v split v

  # enter fullscreen mode for the focused container
  bindsym Shift+f fullscreen toggle

  # change container layout (stacked, tabbed, toggle split)
  bindsym s layout stacking
  bindsym w layout tabbed
  bindsym e layout toggle split

  # toggle tiling / floating
  bindsym space floating toggle

  # change focus between tiling / floating windows
  bindsym space focus mode_toggle

  # switch to workspace
  bindsym f workspace next
  bindsym b workspace prev
  bindsym n focus next
  bindsym p focus prev
  bindsym 1 workspace $ws1
  bindsym 2 workspace $ws2
  bindsym 3 workspace $ws3
  bindsym 4 workspace $ws4

  # move focused container to workspace
  bindsym Shift+f move container to workspace next
  bindsym Shift+b move container to workspace prev
  bindsym Shift+1 move container to workspace $ws1
  bindsym Shift+2 move container to workspace $ws2
  bindsym Shift+3 move container to workspace $ws3
  bindsym Shift+4 move container to workspace $ws4

  # Media
  bindsym XF86AudioRaiseVolume exec --no-startup-id pactl set-sink-volume @DEFAULT_SINK@ +10% &amp;&amp; $refresh_i3status
  bindsym XF86AudioLowerVolume exec --no-startup-id pactl set-sink-volume @DEFAULT_SINK@ -10% &amp;&amp; $refresh_i3status
  bindsym XF86AudioMute exec --no-startup-id pactl set-sink-mute @DEFAULT_SINK@ toggle &amp;&amp; $refresh_i3status
  bindsym XF86AudioMicMute exec --no-startup-id pactl set-source-mute @DEFAULT_SOURCE@ toggle &amp;&amp; $refresh_i3status

  # Kill current window
  bindsym Shift+q kill
  # reload the configuration file
  bindsym Shift+c reload
  # restart i3 inplace (preserves your layout/session, can be used to upgrade i3)
  bindsym Shift+r restart
  # exit i3 (logs you out of your X session)
  # bindsym Shift+e exec "i3-nagbar -t warning -m 'You pressed the exit shortcut. Do you really want to exit i3? This will end your X session.' -B 'Yes, exit i3' 'i3-msg exit'"
  bindsym Shift+e exec i3-msg exit

  bindsym Return mode "default"
  bindsym Escape mode "default"
  bindsym r mode "move/resize"
  bindsym $mod+Return mode "default"
}

# resize window (you can also use the mouse for that)
set $move-resize-gap 10px or 10ppt

mode "move/resize" {
  bindsym Left move left $move-resize-gap
  bindsym Down move down $move-resize-gap
  bindsym Up move up $move-resize-gap
  bindsym Right move right $move-resize-gap

  bindsym Shift+Left resize shrink width $move-resize-gap
  bindsym Shift+Down resize grow height $move-resize-gap
  bindsym Shift+Up resize shrink height $move-resize-gap
  bindsym Shift+Right resize grow width $move-resize-gap

  # back to normal: Enter or Escape or $mod+r
  bindsym Return mode "default"
  bindsym Escape mode "default"
  bindsym "r" mode "i3"
}

bindsym $mod+Return mode "i3"

# Colors configration - https://i3wm.org/docs/userguide.html#_colors
#
# class                 border  backgr. text    indicator child_border
client.focused          #4c7899 #285577 #ffffff #2e9ef4   #285577
client.focused_inactive #333333 #5f676a #ffffff #484e50   #5f676a
client.unfocused        #333333 #222222 #888888 #292d2e   #222222
client.urgent           #2f343a #900000 #ffffff #900000   #900000
client.placeholder      #000000 #0c0c0c #ffffff #000000   #0c0c0c

client.background       #ffffff

# Start i3bar to display a workspace bar (plus the system information i3status
# finds out, if available)
bar {
  mode dock # hide
  hidden_state hide
  modifier $mod
  strip_workspace_numbers yes

  position bottom # top
  font pango:monospace 12
  status_command i3status

  colors {
    background #000000
    statusline #ffffff
    separator #666666

    focused_workspace  #4c7899 #FF8C69 #000000
    active_workspace   #333333 #FF8C69 #000000
    inactive_workspace #333333 #222222 #888888
    urgent_workspace   #2f343a #900000 #ffffff
    binding_mode       #2f343a #900000 #ffffff
  }
}

gaps inner 8px
smart_gaps off # on 
# workspace_layout tabbed
# enable window icons for all windows
for_window [all] title_window_icon on
focus_on_window_activation focus
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(defun minemacs-random-wallpaper (dir)
  "Given a directory, pick a random PNG file and set it as wallpaper via FEH."
  (interactive "DWallaper source directory: ")
  (let* ((images (directory-files dir t "\.png"))
           (image (seq-random-elt images)))
    (shell-command (format "feh --bg-max '%s'" image) nil nil)))
</pre>
</div>
</div>
</div>
