emacs/modules.org
** Emacs as Window Manager - EXWM
:PROPERTIES:
:header-args: :tangle (minemacs-tangle-if-not-disabled "exwm.el") :mkdirp yes
:END:

Useful links:

- [[https://github.com/emacs-exwm/exwm/wiki][User Guide]]
- [[https://wiki.archlinux.org/title/EXWM][archlinux wiki]]

#+begin_src elisp
  (defun minemacs-exwm-enabled? ()
    (equal (getenv "EXWM") "true"))

  (use-package vertico-posframe
    :if (minemacs-exwm-enabled?)
    :custom
    (vertico-posframe-border-width 8)
    :config
    (vertico-posframe-mode 1))
#+end_src

#+begin_src emacs-lisp
  (use-package pulseaudio-control)
#+end_src

#+begin_src elisp
  (use-package exwm
    :if (minemacs-exwm-enabled?)
    :init
    ;; (start-process "dex" nil "dex" "-a" "-e" "i3")
    ;; (start-process "power-manager" nil "xfce4-power-manager")
    ;; (start-process "xfce-settings" nil "xfsettingsd")
    :bind
    (:map key-translation-map
	  ("s-m" . nil)
	  ("s-M" . nil))
    :config
    (server-mode 1)
    (display-battery-mode 1)

    (global-set-key (kbd "<XF86AudioLowerVolume>") #'pulseaudio-control-decrease-sink-volume)
    (global-set-key (kbd "<XF86AudioRaiseVolume>") #'pulseaudio-control-increase-sink-volume)
    (global-set-key (kbd "<XF86AudioMute>") #'pulseaudio-control-toggle-current-sink-mute)
    (global-set-key (kbd "<XF86AudioPlay>") #'minemacs-media-toggle-pause)

    (require 'exwm)
    (setq exwm-workspace-number 1)
    ;; Make class name the buffer name.
    (add-hook 'exwm-update-class-hook
	      (lambda () (exwm-workspace-rename-buffer exwm-class-name)))
    ;; Global keybindings.
    (setq exwm-systemtray-height 25
	  exwm-input-global-keys
	  `(([?\s-k] . execute-extended-command)
	    ([?\s-m] . exwm-reset)
	    ([?\s-M] . exwm-input-release-keyboard)
	    ([?\s-\]] . next-buffer)
	    ([?\s-\[] . previous-buffer)
	    ([?\s-d] . dmenu)
	    ([?\s-`] . other-frame)))

    (setq exwm-input-simulation-keys
	  '(([?\C-b] . [left])
	    ([?\C-f] . [right])
	    ([?\C-p] . [up])
	    ([?\C-n] . [down])
	    ([?\C-a] . [home])
	    ([?\C-e] . [end])
	    ([?\M-v] . [prior])
	    ([?\C-v] . [next])
	    ([?\C-d] . [delete])
	    ([?\C-k] . [S-end delete])))

    (exwm-enable)
    (require 'exwm-systemtray)
    (exwm-systemtray-mode 1))
#+end_src

*** System configuration (Linux Mint/Ubuntu)
:PROPERTIES:
:header-args: :tangle no
:END:

Example script that actually launches Emacs (the WM) and some other services that helps Desktop experience. Create the this file at =/usr/local/bin/exwm.sh=.

#+begin_example sh :tangle /usr/local/bin/exwm.sh
  #!/bin/sh

  ## Set capslock as ctrl
  #
  setxkbmap -layout us -option ctrl:nocaps

  ## Programs to start upon startup
  #

  dbus-launch xfsettingsd &
  dbus-launch xfce4-power-manager &
  dbus-launch nm-applet &                     # Network Manager
  dbus-launch pasystray &                     # Pulseaudio volume control from tray
  dbus-launch dex -a -e i3 &

  ## Start emacs
  #
  export EXWM=true
  # exec dbus-launch --exit-with-session emacs
  exec dbus-run-session emacs
#+end_example

In order to have the =EXWM= desktop environment available in the Login manager menu (i.e. LightDM) add this to =/usr/share/xsessions/exwm.desktop=

#+begin_example conf :tangle /usr/share/xsessions/exwm.desktop
[Desktop Entry]
Name=Exwm
Comment=Emacs as Window Manager
Exec=/usr/local/bin/exwm.sh
TryExec=emacs
Type=Application
X-LightDM-DesktopName=exwm
DesktopNames=exwm
Keywords=tiling;wm;windowmanager;window;manager;emacs;
#+end_example

