emacs/modules.html
<div id="outline-container-orgc0fcefc" class="outline-3">
<h3 id="orgc0fcefc">Emacs as Window Manager - EXWM</h3>
<div class="outline-text-3" id="text-orgc0fcefc">
<p>
Useful links:
</p>

<ul class="org-ul">
<li><a href="https://github.com/emacs-exwm/exwm/wiki">User Guide</a></li>
<li><a href="https://wiki.archlinux.org/title/EXWM">archlinux wiki</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp">(defun minemacs-exwm-enabled? ()
  (equal (getenv "EXWM") "true"))

(use-package vertico-posframe
  :if (minemacs-exwm-enabled?)
  :custom
  (vertico-posframe-border-width 8)
  :config
  (vertico-posframe-mode 1))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package pulseaudio-control)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(use-package exwm
  :if (minemacs-exwm-enabled?)
  :init
  ;; (start-process "dex" nil "dex" "-a" "-e" "i3")
  ;; (start-process "power-manager" nil "xfce4-power-manager")
  ;; (start-process "xfce-settings" nil "xfsettingsd")
  :bind
  (:map key-translation-map
          ("s-m" . nil)
          ("s-M" . nil))
  :config
  (server-mode 1)
  (display-battery-mode 1)

  (global-set-key (kbd "&lt;XF86AudioLowerVolume&gt;") #'pulseaudio-control-decrease-sink-volume)
  (global-set-key (kbd "&lt;XF86AudioRaiseVolume&gt;") #'pulseaudio-control-increase-sink-volume)
  (global-set-key (kbd "&lt;XF86AudioMute&gt;") #'pulseaudio-control-toggle-current-sink-mute)
  (global-set-key (kbd "&lt;XF86AudioPlay&gt;") #'minemacs-media-toggle-pause)

  (require 'exwm)
  (setq exwm-workspace-number 1)
  ;; Make class name the buffer name.
  (add-hook 'exwm-update-class-hook
              (lambda () (exwm-workspace-rename-buffer exwm-class-name)))
  ;; Global keybindings.
  (setq exwm-systemtray-height 25
          exwm-input-global-keys
          `(([?\s-k] . execute-extended-command)
            ([?\s-m] . exwm-reset)
            ([?\s-M] . exwm-input-release-keyboard)
            ([?\s-\]] . next-buffer)
            ([?\s-\[] . previous-buffer)
            ([?\s-d] . dmenu)
            ([?\s-`] . other-frame)))

  (setq exwm-input-simulation-keys
          '(([?\C-b] . [left])
            ([?\C-f] . [right])
            ([?\C-p] . [up])
            ([?\C-n] . [down])
            ([?\C-a] . [home])
            ([?\C-e] . [end])
            ([?\M-v] . [prior])
            ([?\C-v] . [next])
            ([?\C-d] . [delete])
            ([?\C-k] . [S-end delete])))

  (exwm-enable)
  (require 'exwm-systemtray)
  (exwm-systemtray-mode 1))
</pre>
</div>
</div>
<div id="outline-container-org3700fc6" class="outline-4">
<h4 id="org3700fc6">System configuration (Linux Mint/Ubuntu)</h4>
<div class="outline-text-4" id="text-org3700fc6">
<p>
Example script that actually launches Emacs (the WM) and some other services that helps Desktop experience. Create the this file at <code>/usr/local/bin/exwm.sh</code>.
</p>

<pre class="example" id="org5777060">
#!/bin/sh

## Set capslock as ctrl
#
setxkbmap -layout us -option ctrl:nocaps

## Programs to start upon startup
#

dbus-launch xfsettingsd &amp;
dbus-launch xfce4-power-manager &amp;
dbus-launch nm-applet &amp;                     # Network Manager
dbus-launch pasystray &amp;                     # Pulseaudio volume control from tray
dbus-launch dex -a -e i3 &amp;

## Start emacs
#
export EXWM=true
# exec dbus-launch --exit-with-session emacs
exec dbus-run-session emacs
</pre>

<p>
In order to have the <code>EXWM</code> desktop environment available in the Login manager menu (i.e. LightDM) add this to <code>/usr/share/xsessions/exwm.desktop</code>
</p>

<pre class="example" id="org3a5422f">
[Desktop Entry]
Name=Exwm
Comment=Emacs as Window Manager
Exec=/usr/local/bin/exwm.sh
TryExec=emacs
Type=Application
X-LightDM-DesktopName=exwm
DesktopNames=exwm
Keywords=tiling;wm;windowmanager;window;manager;emacs;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-12-10 Tue 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 31.0.50 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
